Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2018 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.2" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2022-01-06T10:27:17Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="SAMRH707F18A-DRB-E" mhc:ordercode="SAMRH707F18A-DRB-E" package="CQFP164" pinout="CQFP164" speedmax="50000000" tempmax="+25" tempmin="+25" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M7" family="SAMRH" name="ATSAMRH707F18A" series="SAMRH707">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW"/>
          <memory-segment name="AXIMX" start="0x22000000" size="0x00100000" type="other" rw="RW"/>
          <memory-segment name="ITCM" start="0x00000000" size="0x00010000" type="other" rw="RW" exec="true"/>
          <memory-segment name="IFLASH" start="0x10000000" size="0x00020000" type="flash" pagesize="256" rw="RW" exec="true"/>
          <memory-segment name="IROM" start="0x11000000" size="0x00020000" type="rom" rw="R"/>
          <memory-segment name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true"/>
          <memory-segment name="FlexRAM" start="0x21000000" size="0x00020000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="EBI_CSHEMC" start="0x60000000" size="0x00200000" type="other" rw="RW" exec="true"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="0x10" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x4" start="0"/>
      </address-spaces>
      <parameters>
        <param name="__CM7_REV" value="0x0101" caption="CM7 Core Revision"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of Bits used for Priority Levels"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__FPU_DP" value="1" caption="Double Precision FPU"/>
        <param name="__ICACHE_PRESENT" value="1" caption="Instruction Cache present"/>
        <param name="__DCACHE_PRESENT" value="1" caption="Data Cache present"/>
        <param name="__ITCM_PRESENT" value="1" caption="Instruction TCM present"/>
        <param name="__DTCM_PRESENT" value="1" caption="Data TCM present"/>
        <param name="__DEBUG_LVL" value="1"/>
        <param name="__TRACE_LVL" value="1"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="ADC" id="44073" version="K">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40200000"/>
            <parameters>
              <param name="INSTANCE_ID" value="23"/>
              <param name="CLOCK_ID" value="23"/>
              <param name="DMAC_ID_RX" value="26"/>
            </parameters>
            <signals>
              <signal pad="PC30" function="A" group="ADTRG"/>
              <signal pad="PA0" function="X1" group="AD" index="0"/>
              <signal pad="PA1" function="X1" group="AD" index="1"/>
              <signal pad="PA2" function="X1" group="AD" index="2"/>
              <signal pad="PA3" function="X1" group="AD" index="3"/>
              <signal pad="PA4" function="X1" group="AD" index="4"/>
              <signal pad="PA5" function="X1" group="AD" index="5"/>
              <signal pad="PA6" function="X1" group="AD" index="6"/>
              <signal pad="PA7" function="X1" group="AD" index="7"/>
              <signal pad="PA8" function="X1" group="AD" index="8"/>
              <signal pad="PA9" function="X1" group="AD" index="9"/>
              <signal pad="PA10" function="X1" group="AD" index="10"/>
              <signal pad="PA11" function="X1" group="AD" index="11"/>
              <signal pad="PA12" function="X1" group="AD" index="12"/>
              <signal pad="PA13" function="X1" group="AD" index="13"/>
              <signal pad="PA14" function="X1" group="AD" index="14"/>
              <signal pad="PA15" function="X1" group="AD" index="15"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZQ">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x40100000"/>
          </instance>
        </module>
        <module name="CRCCU" id="11001" version="I">
          <instance name="CRCCU">
            <register-group address-space="base" name="CRCCU" name-in-module="CRCCU" offset="0x40018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
            </parameters>
          </instance>
        </module>
