Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <module name="DACC" id="6461" version="L">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="24"/>
              <param name="CLOCK_ID" value="24"/>
              <param name="DMAC_ID_TX" value="27"/>
            </parameters>
            <signals>
              <signal pad="PD31" function="X1" group="DAC" index="0"/>
              <signal pad="PD30" function="X1" group="DAC1N"/>
              <signal pad="PD29" function="X1" group="DAC1P"/>
              <signal pad="PD28" function="X1" group="DAC" index="2"/>
              <signal pad="PC29" function="A" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXCOM" id="11268" version="R">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0x40020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
              <param name="CLOCK_ID" value="7"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="16"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA21" function="A" group="FLEXCOM0_IO" index="0"/>
              <signal pad="PA22" function="A" group="FLEXCOM0_IO" index="1"/>
              <signal pad="PA17" function="A" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PA26" function="A" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PA18" function="A" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PA28" function="A" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PA25" function="A" group="FLEXCOM0_IO" index="4"/>
              <signal pad="PA24" function="A" group="FLEXCOM0_IO" index="5"/>
              <signal pad="PA27" function="A" group="FLEXCOM0_IO" index="5"/>
              <signal pad="PA20" function="A" group="FLEXCOM0_IO" index="6"/>
              <signal pad="PA23" function="A" group="FLEXCOM0_IO" index="6"/>
            </signals>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0x40024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
              <param name="CLOCK_ID" value="8"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="DMAC_ID_RX" value="3"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="16"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB4" function="B" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PB5" function="B" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PA30" function="B" group="FLEXCOM1_IO" index="2"/>
              <signal pad="PA29" function="B" group="FLEXCOM1_IO" index="3"/>
              <signal pad="PB3" function="B" group="FLEXCOM1_IO" index="4"/>
              <signal pad="PA15" function="B" group="FLEXCOM1_IO" index="5"/>
              <signal pad="PA16" function="B" group="FLEXCOM1_IO" index="5"/>
              <signal pad="PA14" function="B" group="FLEXCOM1_IO" index="6"/>
              <signal pad="PA31" function="B" group="FLEXCOM1_IO" index="6"/>
            </signals>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0x40028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="13"/>
              <param name="CLOCK_ID" value="13"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="16"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PD8" function="C" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PD9" function="C" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PC16" function="A" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PD13" function="B" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PD26" function="A" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PC17" function="A" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PD17" function="B" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PD27" function="A" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PC18" function="A" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PC31" function="A" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PD11" function="B" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PC19" function="A" group="FLEXCOM2_IO" index="5"/>
              <signal pad="PC20" function="A" group="FLEXCOM2_IO" index="6"/>
              <signal pad="PD15" function="B" group="FLEXCOM2_IO" index="6"/>
            </signals>
          </instance>
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0x4002C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="16"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB22" function="B" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PB21" function="B" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PB17" function="B" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB30" function="B" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB18" function="B" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB31" function="B" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB20" function="B" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB16" function="B" group="FLEXCOM3_IO" index="5"/>
              <signal pad="PB29" function="B" group="FLEXCOM3_IO" index="5"/>
              <signal pad="PB19" function="B" group="FLEXCOM3_IO" index="6"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXRAMECC" id="44124" version="A">
          <instance name="FLEXRAMECC">
            <register-group address-space="base" name="FLEXRAMECC" name-in-module="FLEXRAMECC" offset="0x40100600"/>
