Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
          </instance>
        </module>
        <module name="HEFC" id="44123" version="A">
          <instance name="HEFC">
            <register-group address-space="base" name="HEFC" name-in-module="HEFC" offset="0x40004000"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="INSTANCE_ID" value="50"/>
              <param name="CLOCK_ID" value="50"/>
              <param name="PAGES_PR_REGION" value="512"/>
            </parameters>
          </instance>
        </module>
        <module name="HEMC" id="44121" version="A">
          <instance name="HEMC">
            <register-group address-space="base" name="HEMC" name-in-module="HEMC" offset="0x40080000"/>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
              <param name="ID_HEMC_INTFIX" value="60"/>
              <param name="ID_HEMC_INTNOFIX" value="61"/>
            </parameters>
            <signals>
              <signal pad="PC8" function="B" group="A" index="0"/>
              <signal pad="PC9" function="B" group="A" index="1"/>
              <signal pad="PC10" function="B" group="A" index="2"/>
              <signal pad="PC11" function="B" group="A" index="3"/>
              <signal pad="PC12" function="B" group="A" index="4"/>
              <signal pad="PC13" function="B" group="A" index="5"/>
              <signal pad="PC14" function="B" group="A" index="6"/>
              <signal pad="PC15" function="B" group="A" index="7"/>
              <signal pad="PC16" function="B" group="A" index="8"/>
              <signal pad="PC17" function="B" group="A" index="9"/>
              <signal pad="PC18" function="B" group="A" index="10"/>
              <signal pad="PC19" function="B" group="A" index="11"/>
              <signal pad="PC20" function="B" group="A" index="12"/>
              <signal pad="PC21" function="B" group="A" index="13"/>
              <signal pad="PC22" function="B" group="A" index="14"/>
              <signal pad="PC23" function="B" group="A" index="15"/>
              <signal pad="PC24" function="B" group="A" index="16"/>
              <signal pad="PC25" function="B" group="A" index="17"/>
              <signal pad="PC26" function="B" group="A" index="18"/>
              <signal pad="PC27" function="B" group="A" index="19"/>
              <signal pad="PC28" function="B" group="A" index="20"/>
              <signal pad="PC30" function="X1" group="BOOT_MODE" index="0"/>
              <signal pad="PC29" function="X1" group="BOOT_MODE" index="1"/>
              <signal pad="PA25" function="X1" group="CFG" index="2"/>
              <signal pad="PC0" function="B" group="D" index="0"/>
              <signal pad="PC1" function="B" group="D" index="1"/>
              <signal pad="PC2" function="B" group="D" index="2"/>
              <signal pad="PC3" function="B" group="D" index="3"/>
              <signal pad="PC4" function="B" group="D" index="4"/>
              <signal pad="PC5" function="B" group="D" index="5"/>
              <signal pad="PC6" function="B" group="D" index="6"/>
              <signal pad="PC7" function="B" group="D" index="7"/>
              <signal pad="PD5" function="B" group="NCS" index="0"/>
              <signal pad="PD4" function="B" group="NCS" index="1"/>
              <signal pad="PD6" function="B" group="NRD"/>
              <signal pad="PD8" function="B" group="NWAIT"/>
              <signal pad="PD7" function="B" group="NWE"/>
            </signals>
          </instance>
        </module>
        <module name="HSMC" id="44128" version="A">
          <instance name="HSMC">
            <register-group address-space="base" name="HSMC" name-in-module="HSMC" offset="0x40081000"/>
          </instance>
        </module>
        <module name="ICM" id="11105" version="I">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x4008C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
              <param name="CLOCK_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="IP1553" id="44127" version="A">
          <instance name="IP1553">
            <register-group address-space="base" name="IP1553" name-in-module="IP1553" offset="0x4003C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="68"/>
              <param name="CLOCK_ID" value="68"/>
            </parameters>
            <signals>
              <signal pad="PB28" function="A" group="ARXINN"/>
              <signal pad="PB27" function="A" group="ARXINP"/>
              <signal pad="PB26" function="A" group="ATXOUTN"/>
              <signal pad="PB25" function="A" group="ATXOUTP"/>
              <signal pad="PC3" function="A" group="BRXINN"/>
              <signal pad="PD3" function="A" group="BRXINN"/>
              <signal pad="PC2" function="A" group="BRXINP"/>
              <signal pad="PD2" function="A" group="BRXINP"/>
              <signal pad="PC1" function="A" group="BTXOUTN"/>
              <signal pad="PD1" function="A" group="BTXOUTN"/>
              <signal pad="PC0" function="A" group="BTXOUTP"/>
              <signal pad="PD0" function="A" group="BTXOUTP"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" id="44138" version="A">
          <instance name="MATRIX0">
            <register-group address-space="base" name="MATRIX0" name-in-module="MATRIX" offset="0x40000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="MCAN" id="11273" version="P">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0x40058000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
              <param name="CLOCK_ID" value="36"/>
              <param name="ID_MCAN0_INT0" value="36"/>
              <param name="ID_MCAN0_INT1" value="37"/>
            </parameters>
            <signals>
              <signal pad="PB8" function="A" group="CANRX" index="0"/>
              <signal pad="PB7" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="MCAN1">
            <register-group address-space="base" name="MCAN1" name-in-module="MCAN" offset="0x4005C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38"/>
              <param name="CLOCK_ID" value="38"/>
              <param name="ID_MCAN1_INT0" value="38"/>
              <param name="ID_MCAN1_INT1" value="39"/>
            </parameters>
            <signals>
              <signal pad="PB9" function="A" group="CANRX" index="1"/>
              <signal pad="PC12" function="A" group="CANRX" index="1"/>
              <signal pad="PB10" function="A" group="CANTX" index="1"/>
              <signal pad="PC13" function="A" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
