Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <module name="NMIC" id="44062" version="A">
          <instance name="NMIC">
            <register-group address-space="base" name="NMIC" name-in-module="NMIC" offset="0x400A8000"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
              <param name="NUM_NMIC_SOURCE" value="9"/>
              <param name="NMIC_SOURCE_NMI" value="0" caption="External Pin NMI"/>
              <param name="NMIC_SOURCE_CPU_FAIL" value="1" caption="Wrong CPU Frequency Monitor Detection"/>
              <param name="NMIC_SOURCE_XTAL_12M_FAIL" value="2" caption="Fast XTAL Clock Failure Detection"/>
              <param name="NMIC_SOURCE_XTAL_32K_FAIL" value="3" caption="Slow XTAL 32KHZ Clock Failure Detection"/>
              <param name="NMIC_SOURCE_VDDCORE_FAIL" value="4" caption="VDDCORE Failure Detection"/>
              <param name="NMIC_SOURCE_NOFIX_TCM" value="5" caption="TCM non fixable error Detection"/>
              <param name="NMIC_SOURCE_NOFIX_HEMC" value="6" caption="HEMC non fixable error detection"/>
              <param name="NMIC_SOURCE_NOFIX_HEFC" value="7" caption="HEFC non fixable error detection"/>
              <param name="NMIC_SOURCE_NOFIX_FLEXRAM" value="8" caption="FlexRAM non fixable error detection"/>
              <param name="NMIC_READ_ONLY_GLFEN" value="0" caption="NMIC Glitch filter is read only"/>
            </parameters>
          </instance>
        </module>
        <module name="PCC" id="11276" version="A">
          <instance name="PCC">
            <register-group address-space="base" name="PCC" name-in-module="PCC" offset="0x4001C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="45"/>
              <param name="CLOCK_ID" value="45"/>
              <param name="DMAC_ID_RX" value="28"/>
            </parameters>
            <signals>
              <signal pad="PA20" function="D" group="PCCCLK"/>
              <signal pad="PA0" function="D" group="PCCDATA" index="0"/>
              <signal pad="PA1" function="D" group="PCCDATA" index="1"/>
              <signal pad="PA2" function="D" group="PCCDATA" index="2"/>
              <signal pad="PA3" function="D" group="PCCDATA" index="3"/>
              <signal pad="PA4" function="D" group="PCCDATA" index="4"/>
              <signal pad="PA5" function="D" group="PCCDATA" index="5"/>
              <signal pad="PA6" function="D" group="PCCDATA" index="6"/>
              <signal pad="PA7" function="D" group="PCCDATA" index="7"/>
              <signal pad="PA8" function="D" group="PCCDATA" index="8"/>
              <signal pad="PA9" function="D" group="PCCDATA" index="9"/>
              <signal pad="PA10" function="D" group="PCCDATA" index="10"/>
              <signal pad="PA11" function="D" group="PCCDATA" index="11"/>
              <signal pad="PA12" function="D" group="PCCDATA" index="12"/>
              <signal pad="PA13" function="D" group="PCCDATA" index="13"/>
              <signal pad="PA14" function="D" group="PCCDATA" index="14"/>
              <signal pad="PA15" function="D" group="PCCDATA" index="15"/>
              <signal pad="PA27" function="D" group="PCCDEN" index="1"/>
              <signal pad="PA25" function="D" group="PCCDEN" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PIO" id="11264" version="K">
          <instance name="PIO">
            <register-group address-space="base" name="PIO" name-in-module="PIO" offset="0x40008000"/>
            <parameters>
              <param name="CLOCK_ID" value="10"/>
              <param name="DEBOUNCE_GLITCH_ACTIVE" value="1"/>
            </parameters>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="58" function="default" pad="PB26"/>
              <signal group="P" index="59" function="default" pad="PB27"/>
              <signal group="P" index="60" function="default" pad="PB28"/>
              <signal group="P" index="64" function="default" pad="PC0"/>
              <signal group="P" index="65" function="default" pad="PC1"/>
              <signal group="P" index="66" function="default" pad="PC2"/>
              <signal group="P" index="67" function="default" pad="PC3"/>
              <signal group="P" index="68" function="default" pad="PC4"/>
              <signal group="P" index="69" function="default" pad="PC5"/>
              <signal group="P" index="70" function="default" pad="PC6"/>
              <signal group="P" index="71" function="default" pad="PC7"/>
              <signal group="P" index="72" function="default" pad="PC8"/>
              <signal group="P" index="73" function="default" pad="PC9"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
              <signal group="P" index="87" function="default" pad="PC23"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
              <signal group="P" index="93" function="default" pad="PC29"/>
              <signal group="P" index="94" function="default" pad="PC30"/>
              <signal group="P" index="96" function="default" pad="PD0"/>
              <signal group="P" index="97" function="default" pad="PD1"/>
              <signal group="P" index="98" function="default" pad="PD2"/>
              <signal group="P" index="99" function="default" pad="PD3"/>
              <signal group="P" index="100" function="default" pad="PD4"/>
              <signal group="P" index="101" function="default" pad="PD5"/>
              <signal group="P" index="102" function="default" pad="PD6"/>
              <signal group="P" index="103" function="default" pad="PD7"/>
              <signal group="P" index="104" function="default" pad="PD8"/>
              <signal group="P" index="105" function="default" pad="PD9"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="109" function="default" pad="PD13"/>
              <signal group="P" index="110" function="default" pad="PD14"/>
              <signal group="P" index="111" function="default" pad="PD15"/>
              <signal group="P" index="112" function="default" pad="PD16"/>
              <signal group="P" index="113" function="default" pad="PD17"/>
              <signal group="P" index="114" function="default" pad="PD18"/>
              <signal group="P" index="115" function="default" pad="PD19"/>
              <signal group="P" index="116" function="default" pad="PD20"/>
              <signal group="P" index="117" function="default" pad="PD21"/>
              <signal group="P" index="118" function="default" pad="PD22"/>
              <signal group="P" index="119" function="default" pad="PD23"/>
              <signal group="P" index="120" function="default" pad="PD24"/>
              <signal group="P" index="121" function="default" pad="PD25"/>
              <signal group="P" index="124" function="default" pad="PD28"/>
              <signal group="P" index="125" function="default" pad="PD29"/>
              <signal group="P" index="126" function="default" pad="PD30"/>
              <signal group="P" index="127" function="default" pad="PD31"/>
            </signals>
          </instance>
          <instance name="PIOA">
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
