Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
          <instance name="PIOC">
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
          <instance name="PIOD">
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="44113" version="A">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x4000C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
            <signals>
              <signal pad="PA19" function="A" group="PCK" index="0"/>
              <signal pad="PA30" function="A" group="PCK" index="1"/>
              <signal pad="PA31" function="A" group="PCK" index="1"/>
              <signal pad="PD8" function="A" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="6343" version="ZB">
          <instance name="PWM0">
            <register-group address-space="base" name="PWM0" name-in-module="PWM" offset="0x40068000"/>
            <parameters>
              <param name="INSTANCE_ID" value="31"/>
              <param name="CLOCK_ID" value="31"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - ADC"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - TC0"/>
            </parameters>
            <signals>
              <signal pad="PA19" function="B" group="PWMC0_PWMEXTRG" index="0"/>
              <signal pad="PB1" function="B" group="PWMC0_PWMEXTRG" index="1"/>
              <signal pad="PA29" function="D" group="PWMC0_PWMFI" index="0"/>
              <signal pad="PA30" function="D" group="PWMC0_PWMFI" index="1"/>
              <signal pad="PA16" function="C" group="PWMC0_PWMFI" index="2"/>
              <signal pad="PB11" function="A" group="PWMC0_PWMH" index="0"/>
              <signal pad="PB13" function="A" group="PWMC0_PWMH" index="1"/>
              <signal pad="PB15" function="A" group="PWMC0_PWMH" index="2"/>
              <signal pad="PB17" function="A" group="PWMC0_PWMH" index="3"/>
              <signal pad="PB12" function="A" group="PWMC0_PWML" index="0"/>
              <signal pad="PB14" function="A" group="PWMC0_PWML" index="1"/>
              <signal pad="PB16" function="A" group="PWMC0_PWML" index="2"/>
              <signal pad="PB18" function="A" group="PWMC0_PWML" index="3"/>
            </signals>
          </instance>
          <instance name="PWM1">
            <register-group address-space="base" name="PWM1" name-in-module="PWM" offset="0x4006C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM1_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM1_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM1_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - ADC"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - TC0"/>
            </parameters>
            <signals>
              <signal pad="PD5" function="A" group="PWMC1_PWMEXTRG" index="0"/>
              <signal pad="PC19" function="C" group="PWMC1_PWMEXTRG" index="1"/>
              <signal pad="PD4" function="A" group="PWMC1_PWMFI" index="0"/>
              <signal pad="PC16" function="C" group="PWMC1_PWMFI" index="1"/>
              <signal pad="PC18" function="C" group="PWMC1_PWMFI" index="2"/>
              <signal pad="PC4" function="A" group="PWMC1_PWMH" index="0"/>
              <signal pad="PC6" function="A" group="PWMC1_PWMH" index="1"/>
              <signal pad="PC8" function="A" group="PWMC1_PWMH" index="2"/>
              <signal pad="PC10" function="A" group="PWMC1_PWMH" index="3"/>
              <signal pad="PC5" function="A" group="PWMC1_PWML" index="0"/>
              <signal pad="PC7" function="A" group="PWMC1_PWML" index="1"/>
              <signal pad="PC9" function="A" group="PWMC1_PWML" index="2"/>
              <signal pad="PC11" function="A" group="PWMC1_PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="N">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x40100200"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RSWDT" id="11110" version="G">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x40100300"/>
            <parameters>
              <param name="INSTANCE_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="6056" version="ZF">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x40100260"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <signals>
              <signal pad="PB2" function="A" group="RTCOUT" index="0"/>
              <signal pad="PD6" function="A" group="RTCOUT" index="1"/>
              <signal pad="PD9" function="B" group="RTCOUT" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="RTT" id="6081" version="N">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x40100230"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SFR" id="5003" version="A">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0x400A0000"/>
            <parameters>
              <param name="INSTANCE_ID" value="62"/>
            </parameters>
          </instance>
        </module>
        <module name="SHA" id="6156" version="O">
          <instance name="SHA">
            <register-group address-space="base" name="SHA" name-in-module="SHA" offset="0x40094000"/>
            <parameters>
              <param name="INSTANCE_ID" value="44"/>
              <param name="CLOCK_ID" value="44"/>
              <param name="DMAC_ID_TX" value="13"/>
            </parameters>
          </instance>
        </module>
        <module name="SPW" id="44126" version="B">
          <instance name="SPW">
            <register-group address-space="base" name="SPW" name-in-module="SPW" offset="0x40040000"/>
            <parameters>
              <param name="INSTANCE_ID_SPW" value="65"/>
              <param name="INSTANCE_ID_SPW_TIMETICK" value="66"/>
              <param name="CLOCK_ID_SPWCLK" value="65"/>
              <param name="CLOCK_ID_TIMETICK" value="66"/>
            </parameters>
            <signals>
              <signal pad="PD11" function="A" group="SPWDINN" index="0"/>
              <signal pad="PD19" function="A" group="SPWDINN" index="1"/>
              <signal pad="PD10" function="A" group="SPWDINP" index="0"/>
              <signal pad="PD18" function="A" group="SPWDINP" index="1"/>
              <signal pad="PD13" function="A" group="SPWDOUTN" index="0"/>
              <signal pad="PD21" function="A" group="SPWDOUTN" index="1"/>
              <signal pad="PD12" function="A" group="SPWDOUTP" index="0"/>
              <signal pad="PD20" function="A" group="SPWDOUTP" index="1"/>
              <signal pad="PD17" function="A" group="SPWSINN" index="0"/>
              <signal pad="PD25" function="A" group="SPWSINN" index="1"/>
              <signal pad="PD16" function="A" group="SPWSINP" index="0"/>
              <signal pad="PD24" function="A" group="SPWSINP" index="1"/>
              <signal pad="PD15" function="A" group="SPWSOUTN" index="0"/>
              <signal pad="PD23" function="A" group="SPWSOUTN" index="1"/>
              <signal pad="PD14" function="A" group="SPWSOUTP" index="0"/>
              <signal pad="PD22" function="A" group="SPWSOUTP" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" id="44082" version="C">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x40100210"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZO">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40070000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_CPA" value="14"/>
              <param name="DMAC_ID_CPB" value="17"/>
              <param name="DMAC_ID_CPC" value="20"/>
              <param name="DMAC_ID_ETRG" value="23"/>
              <param name="INSTANCE_ID_CHANNEL0" value="25"/>
              <param name="INSTANCE_ID_CHANNEL1" value="26"/>
              <param name="INSTANCE_ID_CHANNEL2" value="27"/>
              <param name="CLOCK_ID_CHANNEL0" value="25"/>
              <param name="CLOCK_ID_CHANNEL1" value="26"/>
              <param name="CLOCK_ID_CHANNEL2" value="27"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB18" function="C" group="TCLK" index="0"/>
              <signal pad="PA20" function="C" group="TCLK" index="1"/>
              <signal pad="PA25" function="C" group="TCLK" index="2"/>
              <signal pad="PB19" function="C" group="TCLK" index="2"/>
              <signal pad="PA29" function="C" group="TIOA" index="0"/>
              <signal pad="PA27" function="C" group="TIOA" index="1"/>
              <signal pad="PA28" function="C" group="TIOA" index="2"/>
              <signal pad="PB0" function="C" group="TIOA" index="2"/>
              <signal pad="PA30" function="C" group="TIOB" index="0"/>
              <signal pad="PB17" function="C" group="TIOB" index="1"/>
              <signal pad="PA26" function="C" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40074000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="11"/>
              <param name="DMAC_ID_CPA" value="15"/>
              <param name="DMAC_ID_CPB" value="18"/>
              <param name="DMAC_ID_CPC" value="21"/>
              <param name="DMAC_ID_ETRG" value="24"/>
              <param name="INSTANCE_ID_CHANNEL0" value="28"/>
              <param name="INSTANCE_ID_CHANNEL1" value="29"/>
              <param name="INSTANCE_ID_CHANNEL2" value="30"/>
              <param name="CLOCK_ID_CHANNEL0" value="28"/>
              <param name="CLOCK_ID_CHANNEL1" value="29"/>
              <param name="CLOCK_ID_CHANNEL2" value="30"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB11" function="C" group="TCLK" index="3"/>
              <signal pad="PB12" function="C" group="TCLK" index="4"/>
              <signal pad="PB1" function="C" group="TCLK" index="5"/>
              <signal pad="PB7" function="C" group="TIOA" index="3"/>
              <signal pad="PB13" function="C" group="TIOA" index="4"/>
              <signal pad="PB16" function="C" group="TIOA" index="5"/>
              <signal pad="PB8" function="C" group="TIOB" index="3"/>
              <signal pad="PB14" function="C" group="TIOB" index="4"/>
              <signal pad="PB15" function="C" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40078000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="DMAC_ID_CPA" value="16"/>
              <param name="DMAC_ID_CPB" value="19"/>
              <param name="DMAC_ID_CPC" value="22"/>
              <param name="DMAC_ID_ETRG" value="25"/>
              <param name="INSTANCE_ID_CHANNEL0" value="53"/>
              <param name="INSTANCE_ID_CHANNEL1" value="54"/>
              <param name="INSTANCE_ID_CHANNEL2" value="55"/>
              <param name="CLOCK_ID_CHANNEL0" value="53"/>
              <param name="CLOCK_ID_CHANNEL1" value="54"/>
              <param name="CLOCK_ID_CHANNEL2" value="55"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PC11" function="C" group="TCLK" index="6"/>
              <signal pad="PC10" function="C" group="TCLK" index="7"/>
              <signal pad="PC26" function="C" group="TCLK" index="8"/>
              <signal pad="PC8" function="C" group="TIOA" index="6"/>
              <signal pad="PC14" function="C" group="TIOA" index="7"/>
              <signal pad="PC27" function="C" group="TIOA" index="8"/>
              <signal pad="PC9" function="C" group="TIOB" index="6"/>
              <signal pad="PC15" function="C" group="TIOB" index="7"/>
              <signal pad="PC28" function="C" group="TIOB" index="8"/>
            </signals>
          </instance>
        </module>
