Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <module name="TCMECC" id="44125" version="A">
          <instance name="TCMECC">
            <register-group address-space="base" name="TCMECC" name-in-module="TCMECC" offset="0x40100400"/>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="K">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40090000"/>
            <parameters>
              <param name="INSTANCE_ID" value="63"/>
              <param name="CLOCK_ID" value="63"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="6080" version="N">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x40100250"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="N">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40098000"/>
            <parameters>
              <param name="INSTANCE_ID" value="64"/>
              <param name="CLOCK_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SCnSCB">
          <!-- System control Register not in SCB -->
          <instance name="SCnSCB">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SCnSCB" name="SCnSCB"/>
          </instance>
        </module>
        <module name="SCB">
          <instance name="SCB" oldname="SystemControl">
            <register-group address-space="base" offset="0xE000ED00" name-in-module="SCB" name="SCB"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
        <module name="FPU">
          <instance name="FPU">
            <register-group address-space="base" offset="0xE000EF30" name-in-module="FPU" name="FPU"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match" header:alternate-caption="Memory Management Fault"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" header:alternate-caption="Bus Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition" header:alternate-caption="Usage Fault"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor" header:alternate-caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer 0"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="MATRIX0" name="MATRIX0" caption="Matrix 0"/>
        <interrupt index="7" module-instance="FLEXCOM0" name="FLEXCOM0" caption="FLEXCOM 0"/>
        <interrupt index="8" module-instance="FLEXCOM1" name="FLEXCOM1" caption="FLEXCOM 1"/>
        <interrupt index="9" module-instance="NMIC" name="NMIC" caption="NMI Controller"/>
        <interrupt index="10" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="11" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="12" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="13" module-instance="FLEXCOM2" name="FLEXCOM2" caption="FLEXCOM 2"/>
        <interrupt index="14" module-instance="FLEXCOM3" name="FLEXCOM3" caption="FLEXCOM 3"/>
        <interrupt index="16" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller D"/>
        <interrupt index="18" module-instance="SCB" name="CCW" caption="Cache ECC Warning"/>
        <interrupt index="19" module-instance="SCB" name="CCF" caption="Cache ECC Fault"/>
        <interrupt index="20" module-instance="FPU" name="FPU" caption="Floating Point Unit"/>
        <interrupt index="21" module-instance="FPU" name="IXC" caption="Floating Point Unit IXC"/>
        <interrupt index="22" module-instance="CRCCU" name="CRCCU" caption="CRCCU_HCBDMA"/>
        <interrupt index="23" module-instance="ADC" name="ADC" caption="ADC controller"/>
        <interrupt index="24" module-instance="DACC" name="DACC" caption="DAC Controller"/>
        <interrupt index="25" module-instance="TC0" name="TC0" header:alternate-name="TC0_CH0" caption="Timer/Counter 0" header:alternate-caption="Timer/Counter 0 Channel 0"/>
        <interrupt index="26" module-instance="TC0" name="TC1" header:alternate-name="TC0_CH1" caption="Timer/Counter 1" header:alternate-caption="Timer/Counter 0 Channel 1"/>
        <interrupt index="27" module-instance="TC0" name="TC2" header:alternate-name="TC0_CH2" caption="Timer/Counter 2" header:alternate-caption="Timer/Counter 0 Channel 2"/>
        <interrupt index="28" module-instance="TC1" name="TC3" header:alternate-name="TC1_CH0" caption="Timer/Counter 3" header:alternate-caption="Timer/Counter 1 Channel 0"/>
        <interrupt index="29" module-instance="TC1" name="TC4" header:alternate-name="TC1_CH1" caption="Timer/Counter 4" header:alternate-caption="Timer/Counter 1 Channel 1"/>
        <interrupt index="30" module-instance="TC1" name="TC5" header:alternate-name="TC1_CH2" caption="Timer/Counter 5" header:alternate-caption="Timer/Counter 1 Channel 2"/>
        <interrupt index="31" module-instance="PWM0" name="PWM0" caption="Pulse Width Modulation 0"/>
        <interrupt index="32" module-instance="PWM1" name="PWM1" caption="Pulse Width Modulation 1"/>
        <interrupt index="33" module-instance="ICM" name="ICM" caption="Integrity Check Monitor"/>
        <interrupt index="36" module-instance="MCAN0" name="MCAN0_INT0" caption="MCAN Controller 0 Interrupt 0"/>
        <interrupt index="37" module-instance="MCAN0" name="MCAN0_INT1" caption="MCAN Controller 0 Interrupt 1"/>
        <interrupt index="38" module-instance="MCAN1" name="MCAN1_INT0" caption="MCAN Controller 1 Interrupt 0"/>
        <interrupt index="39" module-instance="MCAN1" name="MCAN1_INT1" caption="MCAN Controller 1 Interrupt 1"/>
        <interrupt index="40" module-instance="TCMECC" name="TCMECC_INTFIX" caption="TCM ECC Fixable error detected"/>
        <interrupt index="41" module-instance="TCMECC" name="TCMECC_INTNOFIX" caption="TCM ECC Un-Fixable error detected"/>
        <interrupt index="42" module-instance="FLEXRAMECC" name="FLEXRAMECC_INTFIX" caption="FlexRAM ECC Fixable error detected"/>
        <interrupt index="43" module-instance="FLEXRAMECC" name="FLEXRAMECC_INTNOFIX" caption="FlexRAM ECC Un-Fixable error detected"/>
        <interrupt index="44" module-instance="SHA" name="SHA" caption="Secure Hash Algorithm"/>
        <interrupt index="45" module-instance="PCC" name="PCC" caption="PCC controller"/>
        <interrupt index="47" module-instance="RSWDT" name="RSWDT" caption="Reinforced Secure Watchdog Timer"/>
        <interrupt index="50" module-instance="HEFC" name="HEFC_INT0" caption="HEFC Flash Interrupts"/>
        <interrupt index="51" module-instance="HEFC" name="HEFC_INTFIX" caption="HEFC ECC Fixable error detected"/>
        <interrupt index="52" module-instance="HEFC" name="HEFC_INTNOFIX" caption="HEFC ECC Un-Fixable error detected"/>
        <interrupt index="53" module-instance="TC2" name="TC6" header:alternate-name="TC2_CH0" caption="Timer/Counter 6" header:alternate-caption="Timer/Counter 2 Channel 0"/>
        <interrupt index="54" module-instance="TC2" name="TC7" header:alternate-name="TC2_CH1" caption="Timer/Counter 7" header:alternate-caption="Timer/Counter 2 Channel 1"/>
        <interrupt index="55" module-instance="TC2" name="TC8" header:alternate-name="TC2_CH2" caption="Timer/Counter 8" header:alternate-caption="Timer/Counter 2 Channel 2"/>
        <interrupt index="59" module-instance="HEMC" name="HEMC_INTSDRAMC" caption="HEMC SDRAM Controller"/>
        <interrupt index="60" module-instance="HEMC" name="HEMC_INTFIX" caption="HEMC ECC Fixable error detected"/>
        <interrupt index="61" module-instance="HEMC" name="HEMC_INTNOFIX" caption="HEMC ECC Un-Fixable error detected"/>
        <interrupt index="62" module-instance="SFR" name="SFR" caption="Special Function Register"/>
        <interrupt index="63" module-instance="TRNG" name="TRNG" caption="True Random Generator"/>
        <interrupt index="64" module-instance="XDMAC" name="XDMAC" caption="eXtended DMA Controller"/>
        <interrupt index="65" module-instance="SPW" name="SPW" caption="SpaceWire"/>
        <interrupt index="68" module-instance="IP1553" name="IP1553" caption="MIL 1553"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05D0603F"/>
          <property name="CHIPID_CIDR" value="0xB1770700"/>
          <property name="CHIPID_EXID" value="0x00000001"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-Digital Converter" name="ADC" id="44073" version="K">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Comparison Restart" mask="0x00000010" name="CMPRST"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Low resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wakeup" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free running" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Startup Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settlings Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Time" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Maximum Sampling Rate Enable in Freerun Mode" mask="0x40000000" name="MAXSPEED"/>
          <bitfield caption="User Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
