Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Tracking time x4" name="ADC_EMR__TRACKX4">
        <value caption="The ADC_MR.TRACKTIM field effect is multiplied by 1." name="TRACK1" value="0"/>
        <value caption="The ADC_MR.TRACKTIM field effect is multiplied by 4." name="TRACK4" value="1"/>
      </value-group>
      <value-group caption="ADC Running Mode" name="ADC_EMR__ADCMODE">
        <value caption="Normal mode of operation." name="NORMAL" value="0x0"/>
        <value caption="Offset Error mode to measure the offset error. See Table 7-6." name="OFFSET_ERROR" value="0x1"/>
        <value caption="Gain Error mode to measure the gain error. See Table 7-6." name="GAIN_ERROR_HIGH" value="0x2"/>
        <value caption="Gain Error mode to measure the gain error. See Table 7-6." name="GAIN_ERROR_LOW" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 0" name="ADC_CGR__GAIN0">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 1" name="ADC_CGR__GAIN1">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 2" name="ADC_CGR__GAIN2">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 3" name="ADC_CGR__GAIN3">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 4" name="ADC_CGR__GAIN4">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 5" name="ADC_CGR__GAIN5">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 6" name="ADC_CGR__GAIN6">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 7" name="ADC_CGR__GAIN7">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 8" name="ADC_CGR__GAIN8">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
