Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Gain for Channel 9" name="ADC_CGR__GAIN9">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 10" name="ADC_CGR__GAIN10">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 11" name="ADC_CGR__GAIN11">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 12" name="ADC_CGR__GAIN12">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 13" name="ADC_CGR__GAIN13">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 14" name="ADC_CGR__GAIN14">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Gain for Channel 15" name="ADC_CGR__GAIN15">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" id="6417" version="ZQ">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID" values="CHIPID_EXID__EXID"/>
        </register>
      </register-group>
