Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Embedded Processor" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Second Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Internal SRAM Size" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="Architecture Identifier" name="CHIPID_CIDR__ARCH">
        <value caption="SAMRH707" name="SAMRH707" value="0x17"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Type" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory - NVPSIZ is ROM size - NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
      <value-group caption="Chip ID Extension" name="CHIPID_EXID__EXID">
        <value caption="164-lead package" name="PACKAGE_TYPE_164" value="0x0"/>
        <value caption="484-balls BGA package" name="PACKAGE_TYPE_BGA_484" value="0x1"/>
        <value caption="144-lead package" name="PACKAGE_TYPE_144" value="0x2"/>
      </value-group>
    </module>
    <module caption="Cyclic Redundancy Check Calculation Unit" name="CRCCU" id="11001" version="I">
      <register-group name="CRCCU">
        <register caption="CRCCU Descriptor Base Register" name="CRCCU_DSCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Descriptor Base Address" mask="0xFFFFFE00" name="DSCR"/>
        </register>
        <register caption="CRCCU DMA Enable Register" name="CRCCU_DMA_EN" offset="0x008" rw="W" size="4">
          <bitfield caption="DMA Enable" mask="0x00000001" name="DMAEN"/>
        </register>
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x00C" rw="W" size="4">
          <bitfield caption="DMA Disable" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x010" rw="R" size="4">
          <bitfield caption="DMA Status" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x014" rw="W" size="4" atomic-op="set:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x018" rw="W" size="4" atomic-op="clear:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x001C" rw="R" size="4" atomic-op="read:CRCCU_DMA_IMR">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x020" rw="R" size="4" atomic-op="read:CRCCU_DMA_ISR">
          <bitfield caption="Interrupt Status" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
          <bitfield caption="Precomputation Bit Swap Operation of the CRC" mask="0x00020000" name="BITORDER" values="CRCCU_MR__BITORDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x03C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
        <register caption="CRCCU Interrupt Enable Register" name="CRCCU_IER" offset="0x040" rw="W" size="4" atomic-op="set:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000001" name="ERRIER"/>
        </register>
        <register caption="CRCCU Interrupt Disable Register" name="CRCCU_IDR" offset="0x044" rw="W" size="4" atomic-op="clear:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Disable" mask="0x00000001" name="ERRIDR"/>
        </register>
        <register caption="CRCCU Interrupt Mask Register" name="CRCCU_IMR" offset="0x048" rw="R" size="4" atomic-op="read:CRCCU_IMR">
          <bitfield caption="CRC Error Interrupt Mask" mask="0x00000001" name="ERRIMR"/>
        </register>
