Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="CRCCU Interrupt Status Register" name="CRCCU_ISR" offset="0x004C" rw="R" size="4" atomic-op="read:CRCCU_ISR">
          <bitfield caption="CRC Error Interrupt Status" mask="0x00000001" name="ERRISR"/>
        </register>
      </register-group>
      <value-group caption="Primitive Polynomial" name="CRCCU_MR__PTYPE">
        <value caption="Polynom 0x04C11DB7" name="CCITT8023" value="0x0"/>
        <value caption="Polynom 0x1EDC6F41" name="CASTAGNOLI" value="0x1"/>
        <value caption="Polynom 0x1021" name="CCITT16" value="0x2"/>
      </value-group>
      <value-group caption="Precomputation Bit Swap Operation of the CRC" name="CRCCU_MR__BITORDER">
        <value caption="CRC computation is performed from the most significant bit to the least significant bit" name="MSBFIRST" value="0"/>
        <value caption="CRC computation is performed from the least significant bit to the most significant bit" name="LSBFIRST" value="1"/>
      </value-group>
    </module>
    <module caption="Digital-to-Analog Converter Controller" name="DACC" id="6461" version="L">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="DACC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="DACC_MR__TRGSEL"/>
          <bitfield caption="Word Transfer" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Must Be Set to 1" mask="0x00000100" name="ONE"/>
          <bitfield caption="User Channel Selection" mask="0x00030000" name="USER_SEL" values="DACC_MR__USER_SEL"/>
          <bitfield caption="Tag Selection Mode" mask="0x00100000" name="TAG" values="DACC_MR__TAG"/>
          <bitfield caption="Maximum Speed Mode" mask="0x00200000" name="MAXS" values="DACC_MR__MAXS"/>
          <bitfield caption="Shall be always write at '0'" mask="0x00400000" name="CLKDIV"/>
          <bitfield caption="Startup Time Selection" mask="0x3F000000" name="STARTUP" values="DACC_MR__STARTUP"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:DACC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:DACC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
        </register>
        <register caption="Conversion Data Register" name="DACC_CDR" offset="0x20" rw="W" size="4">
          <bitfield caption="Data to Convert" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Enable" mask="0x00000002" name="EOC"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable." mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Disable" mask="0x00000002" name="EOC"/>
        </register>
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Mask" mask="0x00000002" name="EOC"/>
        </register>
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:DACC_ISR">
          <bitfield caption="Transmit Ready Interrupt Flag" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Flag" mask="0x00000002" name="EOC"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
          <bitfield caption="Analog Output Current Control" mask="0x00000030" name="IBCTLCH2"/>
          <bitfield caption="Bias Current Control for DAC Core" mask="0x00000300" name="IBCTLDACCORE"/>
        </register>
        <register caption="Write Protection Mode Register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="DACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Trigger Enable" name="DACC_MR__TRGEN">
        <value caption="External trigger mode disabled. DACC in free-running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="Trigger Selection" name="DACC_MR__TRGSEL">
        <value caption="External trigger" name="TRGSEL0" value="0x0"/>
        <value caption="TIOA Output of the Timer Counter Channel 0" name="TRGSEL1" value="0x1"/>
        <value caption="TIOA Output of the Timer Counter Channel 1" name="TRGSEL2" value="0x2"/>
        <value caption="TIOA Output of the Timer Counter Channel 2" name="TRGSEL3" value="0x3"/>
        <value caption="PWM Event Line 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM Event Line 1" name="TRGSEL5" value="0x5"/>
      </value-group>
      <value-group caption="Word Transfer" name="DACC_MR__WORD">
        <value caption="Half-word transfer" name="HALF" value="0"/>
        <value caption="Word transfer" name="WORD" value="1"/>
      </value-group>
