Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="User Channel Selection" name="DACC_MR__USER_SEL">
        <value caption="Channel 0" name="CHANNEL0" value="0"/>
        <value caption="Channel 1" name="CHANNEL1" value="1"/>
        <value caption="Channel 2" name="CHANNEL2" value="2"/>
      </value-group>
      <value-group caption="Tag Selection Mode" name="DACC_MR__TAG">
        <value caption="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." name="DIS" value="0"/>
        <value caption="Tag selection mode enabled" name="EN" value="1"/>
      </value-group>
      <value-group caption="Maximum Speed Mode" name="DACC_MR__MAXS">
        <value caption="Normal mode" name="NORMAL" value="0"/>
        <value caption="Maximum speed mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="Startup Time Selection" name="DACC_MR__STARTUP">
        <value caption="0 periods of peripheral clock" name="_0" value="0x0"/>
        <value caption="8 periods of peripheral clock" name="_8" value="0x1"/>
        <value caption="16 periods of peripheral clock" name="_16" value="0x2"/>
        <value caption="24 periods of peripheral clock" name="_24" value="0x3"/>
        <value caption="64 periods of peripheral clock" name="_64" value="0x4"/>
        <value caption="80 periods of peripheral clock" name="_80" value="0x5"/>
        <value caption="96 periods of peripheral clock" name="_96" value="0x6"/>
        <value caption="112 periods of peripheral clock" name="_112" value="0x7"/>
        <value caption="512 periods of peripheral clock" name="_512" value="0x8"/>
        <value caption="576 periods of peripheral clock" name="_576" value="0x9"/>
        <value caption="640 periods of peripheral clock" name="_640" value="0xA"/>
        <value caption="704 periods of peripheral clock" name="_704" value="0xB"/>
        <value caption="768 periods of peripheral clock" name="_768" value="0xC"/>
        <value caption="832 periods of peripheral clock" name="_832" value="0xD"/>
        <value caption="896 periods of peripheral clock" name="_896" value="0xE"/>
        <value caption="960 periods of peripheral clock" name="_960" value="0xF"/>
        <value caption="1024 periods of peripheral clock" name="_1024" value="0x10"/>
        <value caption="1088 periods of peripheral clock" name="_1088" value="0x11"/>
        <value caption="1152 periods of peripheral clock" name="_1152" value="0x12"/>
        <value caption="1216 periods of peripheral clock" name="_1216" value="0x13"/>
        <value caption="1280 periods of peripheral clock" name="_1280" value="0x14"/>
        <value caption="1344 periods of peripheral clock" name="_1344" value="0x15"/>
        <value caption="1408 periods of peripheral clock" name="_1408" value="0x16"/>
        <value caption="1472 periods of peripheral clock" name="_1472" value="0x17"/>
        <value caption="1536 periods of peripheral clock" name="_1536" value="0x18"/>
        <value caption="1600 periods of peripheral clock" name="_1600" value="0x19"/>
        <value caption="1664 periods of peripheral clock" name="_1664" value="0x1A"/>
        <value caption="1728 periods of peripheral clock" name="_1728" value="0x1B"/>
        <value caption="1792 periods of peripheral clock" name="_1792" value="0x1C"/>
        <value caption="1856 periods of peripheral clock" name="_1856" value="0x1D"/>
        <value caption="1920 periods of peripheral clock" name="_1920" value="0x1E"/>
        <value caption="1984 periods of peripheral clock" name="_1984" value="0x1F"/>
        <value caption="2048 periods of peripheral clock" name="_2048" value="0x20"/>
        <value caption="2112 periods of peripheral clock" name="_2112" value="0x21"/>
        <value caption="2176 periods of peripheral clock" name="_2176" value="0x22"/>
        <value caption="2240 periods of peripheral clock" name="_2240" value="0x23"/>
        <value caption="2304 periods of peripheral clock" name="_2304" value="0x24"/>
        <value caption="2368 periods of peripheral clock" name="_2368" value="0x25"/>
        <value caption="2432 periods of peripheral clock" name="_2432" value="0x26"/>
        <value caption="2496 periods of peripheral clock" name="_2496" value="0x27"/>
        <value caption="2560 periods of peripheral clock" name="_2560" value="0x28"/>
        <value caption="2624 periods of peripheral clock" name="_2624" value="0x29"/>
        <value caption="2688 periods of peripheral clock" name="_2688" value="0x2A"/>
        <value caption="2752 periods of peripheral clock" name="_2752" value="0x2B"/>
        <value caption="2816 periods of peripheral clock" name="_2816" value="0x2C"/>
        <value caption="2880 periods of peripheral clock" name="_2880" value="0x2D"/>
        <value caption="2944 periods of peripheral clock" name="_2944" value="0x2E"/>
        <value caption="3008 periods of peripheral clock" name="_3008" value="0x2F"/>
        <value caption="3072 periods of peripheral clock" name="_3072" value="0x30"/>
        <value caption="3136 periods of peripheral clock" name="_3136" value="0x31"/>
        <value caption="3200 periods of peripheral clock" name="_3200" value="0x32"/>
        <value caption="3264 periods of peripheral clock" name="_3264" value="0x33"/>
        <value caption="3328 periods of peripheral clock" name="_3328" value="0x34"/>
        <value caption="3392 periods of peripheral clock" name="_3392" value="0x35"/>
        <value caption="3456 periods of peripheral clock" name="_3456" value="0x36"/>
        <value caption="3520 periods of peripheral clock" name="_3520" value="0x37"/>
        <value caption="3584 periods of peripheral clock" name="_3584" value="0x38"/>
        <value caption="3648 periods of peripheral clock" name="_3648" value="0x39"/>
        <value caption="3712 periods of peripheral clock" name="_3712" value="0x3A"/>
        <value caption="3776 periods of peripheral clock" name="_3776" value="0x3B"/>
        <value caption="3840 periods of peripheral clock" name="_3840" value="0x3C"/>
        <value caption="3904 periods of peripheral clock" name="_3904" value="0x3D"/>
        <value caption="3968 periods of peripheral clock" name="_3968" value="0x3E"/>
        <value caption="4032 periods of peripheral clock" name="_4032" value="0x3F"/>
      </value-group>
