Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Write Protection Key" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
    <module caption="Flexible Serial Communication" name="FLEXCOM" id="11268" version="R">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode Register" name="FLEX_MR" offset="0x000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEX_MR__OPMODE"/>
        </register>
        <register caption="FLEXCOM Receive Holding Register" name="FLEX_RHR" offset="0x010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEX_THR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
        <register caption="USART Control Register" name="FLEX_US_CR" offset="0x200" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" name="TXFLCLR"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" name="REQCLR"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="USART Mode Register" name="FLEX_US_MR" offset="0x204" rw="RW" size="4">
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="FLEX_US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="FLEX_US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="FLEX_US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="FLEX_US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="FLEX_US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="FLEX_US_MR__CHMODE"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
        </register>
        <register caption="USART Interrupt Enable Register" name="FLEX_US_IER" offset="0x208" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="USART Interrupt Disable Register" name="FLEX_US_IDR" offset="0x20C" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="USART Interrupt Mask Register" name="FLEX_US_IMR" offset="0x210" rw="R" size="4">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" name="CMP"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="USART Channel Status Register" name="FLEX_US_CSR" offset="0x214" rw="R" size="4">
          <bitfield caption="Receiver Ready (cleared by reading FLEX_US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing FLEX_US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Timeout" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing FLEX_US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Status" mask="0x00400000" name="CMP"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error" mask="0x01000000" name="MANE"/>
        </register>
