Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SPI FIFO Level Register" name="FLEX_SPI_FLR" offset="0x444" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="SPI Comparison Register" name="FLEX_SPI_CMPR" offset="0x448" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x0000FFFF" name="VAL1"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0xFFFF0000" name="VAL2"/>
        </register>
        <register caption="SPI Write Protection Mode Register" name="FLEX_SPI_WPMR" offset="0x4E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_SPI_WPMR__WPKEY"/>
        </register>
        <register caption="SPI Write Protection Status Register" name="FLEX_SPI_WPSR" offset="0x4E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="TWI Control Register" name="FLEX_TWI_CR" offset="0x600" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="1"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START" modes="DEFAULT"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP" modes="DEFAULT"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" name="MSEN" modes="DEFAULT"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" name="MSDIS" modes="DEFAULT"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" name="SVEN" modes="DEFAULT"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" name="SVDIS" modes="DEFAULT"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK" modes="DEFAULT"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST" modes="DEFAULT"/>
          <bitfield caption="TWI High-Speed Mode Enabled" mask="0x00000100" name="HSEN" modes="DEFAULT"/>
          <bitfield caption="TWI High-Speed Mode Disabled" mask="0x00000200" name="HSDIS" modes="DEFAULT"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" name="SMBEN" modes="DEFAULT"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" name="SMBDIS" modes="DEFAULT"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" name="PECEN" modes="DEFAULT"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" name="PECDIS" modes="DEFAULT"/>
          <bitfield caption="PEC Request" mask="0x00004000" name="PECRQ" modes="DEFAULT"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" name="CLEAR" modes="DEFAULT"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" name="ACMEN" modes="DEFAULT"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" name="ACMDIS" modes="DEFAULT"/>
          <bitfield caption="Transmit Holding Register Clear" mask="0x01000000" name="THRCLR" modes="DEFAULT"/>
          <bitfield caption="Lock Clear" mask="0x04000000" name="LOCKCLR" modes="DEFAULT"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" name="FIFOEN" modes="DEFAULT"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" name="FIFODIS" modes="DEFAULT"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START" modes="FIFO_ENABLED"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" name="MSEN" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" name="MSDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" name="SVEN" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" name="SVDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK" modes="FIFO_ENABLED"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI High-Speed Mode Enabled" mask="0x00000100" name="HSEN" modes="FIFO_ENABLED"/>
          <bitfield caption="TWI High-Speed Mode Disabled" mask="0x00000200" name="HSDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" name="SMBEN" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" name="SMBDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" name="PECEN" modes="FIFO_ENABLED"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" name="PECDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="PEC Request" mask="0x00004000" name="PECRQ" modes="FIFO_ENABLED"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" name="CLEAR" modes="FIFO_ENABLED"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" name="ACMEN" modes="FIFO_ENABLED"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" name="ACMDIS" modes="FIFO_ENABLED"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" name="TXFCLR" modes="FIFO_ENABLED"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" name="RXFCLR" modes="FIFO_ENABLED"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" name="TXFLCLR" modes="FIFO_ENABLED"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" name="FIFOEN" modes="FIFO_ENABLED"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" name="FIFODIS" modes="FIFO_ENABLED"/>
        </register>
