Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="TWI Master Mode Register" name="FLEX_TWI_MMR" offset="0x604" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="FLEX_TWI_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
          <bitfield caption="No Auto-Stop On NACK Error" mask="0x01000000" name="NOAP"/>
        </register>
        <register caption="TWI Slave Mode Register" name="FLEX_TWI_SMR" offset="0x608" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK Enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Slave Address Treated as Data" mask="0x00000010" name="SADAT"/>
          <bitfield caption="TWI Bus Selection" mask="0x00000020" name="BSEL"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Sniffer Mode" mask="0x00000080" name="SNIFF"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
        </register>
        <register caption="TWI Internal Address Register" name="FLEX_TWI_IADR" offset="0x60C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="TWI Clock Waveform Generator Register" name="FLEX_TWI_CWGR" offset="0x610" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00100000" name="BRSRCCLK" values="FLEX_TWI_CWGR__BRSRCCLK"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x3F000000" name="HOLD"/>
        </register>
        <register caption="TWI Status Register" name="FLEX_TWI_SR" offset="0x620" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="1"/>
          <bitfield caption="Transmission Completed (cleared by writing FLEX_TWI_THR)" mask="0x00000001" name="TXCOMP" modes="DEFAULT"/>
          <bitfield caption="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)" mask="0x00000002" name="RXRDY" modes="DEFAULT"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)" mask="0x00000004" name="TXRDY" modes="DEFAULT"/>
          <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD" modes="DEFAULT"/>
          <bitfield caption="Slave Access" mask="0x00000010" name="SVACC" modes="DEFAULT"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" name="GACC" modes="DEFAULT"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" name="OVRE" modes="DEFAULT"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" name="UNRE" modes="DEFAULT"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" name="NACK" modes="DEFAULT"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" name="ARBLST" modes="DEFAULT"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS" modes="DEFAULT"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" name="EOSACC" modes="DEFAULT"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" name="MCACK" modes="DEFAULT"/>
          <bitfield caption="SMBus Alert Flag (cleared on read)" mask="0x00020000" name="SMBAF" modes="DEFAULT"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" name="TOUT" modes="DEFAULT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" name="PECERR" modes="DEFAULT"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" name="SMBDAM" modes="DEFAULT"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" name="SMBHHM" modes="DEFAULT"/>
          <bitfield caption="TWI Lock Due to Frame Errors" mask="0x00800000" name="LOCK" modes="DEFAULT"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" name="SCL" modes="DEFAULT"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" name="SDA" modes="DEFAULT"/>
          <bitfield caption="Start Repeated" mask="0x04000000" name="SR" modes="DEFAULT"/>
          <bitfield caption="Transmission Completed (cleared by writing FLEX_TWI_THR)" mask="0x00000001" name="TXCOMP" modes="FIFO_ENABLED"/>
          <bitfield caption="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)" mask="0x00000002" name="RXRDY" modes="FIFO_ENABLED"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)" mask="0x00000004" name="TXRDY" modes="FIFO_ENABLED"/>
          <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD" modes="FIFO_ENABLED"/>
          <bitfield caption="Slave Access" mask="0x00000010" name="SVACC" modes="FIFO_ENABLED"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" name="GACC" modes="FIFO_ENABLED"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" name="OVRE" modes="FIFO_ENABLED"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" name="UNRE" modes="FIFO_ENABLED"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" name="NACK" modes="FIFO_ENABLED"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" name="ARBLST" modes="FIFO_ENABLED"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS" modes="FIFO_ENABLED"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" name="EOSACC" modes="FIFO_ENABLED"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" name="MCACK" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Alert Flag (cleared on read)" mask="0x00020000" name="SMBAF" modes="FIFO_ENABLED"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" name="TOUT" modes="FIFO_ENABLED"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" name="PECERR" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" name="SMBDAM" modes="FIFO_ENABLED"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" name="SMBHHM" modes="FIFO_ENABLED"/>
          <bitfield caption="Transmit FIFO Lock" mask="0x00800000" name="TXFLOCK" modes="FIFO_ENABLED"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" name="SCL" modes="FIFO_ENABLED"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" name="SDA" modes="FIFO_ENABLED"/>
          <bitfield caption="Start Repeated" mask="0x04000000" name="SR" modes="FIFO_ENABLED"/>
        </register>
