Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="TWI FIFO Interrupt Enable Register" name="FLEX_TWI_FIER" offset="0x664" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Disable Register" name="FLEX_TWI_FIDR" offset="0x668" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI FIFO Interrupt Mask Register" name="FLEX_TWI_FIMR" offset="0x66C" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
        </register>
        <register caption="TWI Debug Register" name="FLEX_TWI_DR" offset="0x6D0" rw="R" size="4">
          <bitfield caption="SleepWalking Enable" mask="0x00000001" name="SWEN"/>
          <bitfield caption="Clock Request" mask="0x00000002" name="CLKRQ"/>
          <bitfield caption="SleepWalking Match" mask="0x00000004" name="SWMATCH"/>
          <bitfield caption="Transfer Pending" mask="0x00000008" name="TRP"/>
        </register>
        <register caption="TWI Write Protection Mode Register" name="FLEX_TWI_WPMR" offset="0x6E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_TWI_WPMR__WPKEY"/>
        </register>
        <register caption="TWI Write Protection Status Register" name="FLEX_TWI_WPSR" offset="0x6E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="FLEXCOM Operating Mode" name="FLEX_MR__OPMODE">
        <value caption="No communication" name="NO_COM" value="0x0"/>
        <value caption="All UART related protocols are selected (RS232, RS485, ) SPI/TWI related registers are not accessible and have no impact on IOs." name="USART" value="0x1"/>
        <value caption="SPI operating mode is selected. USART/TWI related registers are not accessible and have no impact on IOs." name="SPI" value="0x2"/>
        <value caption="All TWI related protocols are selected (TWI, SMBus). USART/SPI related registers are not accessible and have no impact on IOs." name="TWI" value="0x3"/>
      </value-group>
      <value-group caption="USART Mode of Operation" name="FLEX_US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware handshaking" name="HW_HANDSHAKING" value="0x2"/>
      </value-group>
      <value-group caption="Clock Selection" name="FLEX_US_MR__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock divided (DIV = 8) is selected" name="DIV" value="0x1"/>
        <value caption="PMC generic clock is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." name="GCLK" value="0x2"/>
        <value caption="External pin SCK is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="Character Length" name="FLEX_US_MR__CHRL">
        <value caption="Character length is 5 bits" name="5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="Parity Type" name="FLEX_US_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
        <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
      </value-group>
      <value-group caption="Number of Stop Bits" name="FLEX_US_MR__NBSTOP">
        <value caption="1 stop bit" name="1_BIT" value="0x0"/>
        <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" name="1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="Channel Mode" name="FLEX_US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="Transmitter Preamble Pattern" name="FLEX_US_MAN__TX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="Receiver Preamble Pattern detected" name="FLEX_US_MAN__RX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="Comparison Mode" name="FLEX_US_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Transmitter Ready Mode" name="FLEX_US_FMR__TXRDYM">
        <value caption="TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
