Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Receiver Ready Mode" name="FLEX_TWI_FMR__RXRDYM">
        <value caption="RXRDY will be at level '1' when at least one unread data is in the Receive FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="RXRDY will be at level '1' when at least two unread data are in the Receive FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="RXRDY will be at level '1' when at least four unread data are in the Receive FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module caption="FLEXRAMECC" name="FLEXRAMECC" id="44124" version="A">
      <register-group name="FLEXRAMECC">
        <register caption="FLEXRAMECC Control Register" name="FLEXRAMECC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Shall be always write at '1'" mask="0x00000001" name="ONE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
        </register>
        <register caption="FLEXRAMECC Test mode register 1" name="FLEXRAMECC_TESTCB1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Test Check Bit" mask="0x000000FF" name="TCB1"/>
        </register>
        <register caption="FLEXRAMECC Status register" name="FLEXRAMECC_SR" offset="0xC" rw="R" size="4">
          <bitfield caption="Fixable error status" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status" mask="0x00000100" name="MEM_NOFIX"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="write or read access" mask="0x08000000" name="TYPE"/>
        </register>
        <register caption="FLEXRAMECC Interrupt Enable Register" name="FLEXRAMECC_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="Un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="FLEXRAMECC Interrupt Disable Register" name="FLEXRAMECC_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="FLEXRAMECC Interrupt Mask Register" name="FLEXRAMECC_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="FLEXRAMECC Fail address register" name="FLEXRAMECC_FAILAR" offset="0x1C" rw="R" size="4">
          <bitfield caption="address of the error detected" mask="0xFFFFFFFF" name="ADDRESS"/>
        </register>
        <register caption="FLEXRAMECC Fail data register" name="FLEXRAMECC_FAILDR" offset="0x20" rw="R" size="4">
          <bitfield caption="data error" mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
    </module>
    <module caption="Harden Embedded Flash Controller" name="HEFC" id="44123" version="A">
      <register-group name="HEFC">
        <register caption="HEFC Flash Mode Register" name="HEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Power Status Interrupt Enable" mask="0x00000002" name="FPSI"/>
          <bitfield caption="Must be written to 1" mask="0x00010000" name="ONE"/>
        </register>
        <register caption="HEFC Flash Command Register" name="HEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="HEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="HEFC_FCR__FKEY"/>
        </register>
        <register caption="HEFC Flash Status Register" name="HEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing HEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Write Register Error Status (cleared on read)" mask="0x00000010" name="WREER"/>
        </register>
        <register caption="HEFC Flash Result Register" name="HEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="HEFC Flash Power Management Register" name="HEFC_FPMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Power switch enable" mask="0x00000001" name="PWS_EN"/>
          <bitfield caption="Power switch Status" mask="0x00000002" name="PWS_STAT"/>
          <bitfield caption="Power switch Delay" mask="0x0000000C" name="PWS_DLY" values="HEFC_FPMR__PWS_DLY"/>
          <bitfield caption="Variation Factor" mask="0x00003F00" name="VAR_FACTOR"/>
          <bitfield caption="Flash insulated Control Status" mask="0x00010000" name="FUNC_ISOL_CTRL_N"/>
        </register>
        <register caption="Write Protection Mode Register" name="HEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="GPNVM Bit Write Protection" mask="0x00000002" name="GPNVMWP"/>
          <bitfield caption="Lock Bit Write Protection" mask="0x00000004" name="LOCKWP"/>
          <bitfield caption="Page, Sector and Plane Write Protection" mask="0x00000008" name="ERASEWP"/>
          <bitfield caption="User Signature Write Protection" mask="0x00000010" name="USER"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HEFC_WPMR__WPKEY"/>
        </register>
        <register caption="HECC Control Register ChannelNumbers (ChannelNumbers = 0)" name="HEFC_HECC_CR" offset="0x100" rw="RW" size="4" count="16">
          <bitfield caption="ECC protection enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
          <bitfield caption="BCH ECC enable" mask="0x00000040" name="ECC12_ENABLE"/>
        </register>
        <register caption="HECC Test mode ChannelNumbers (ChannelNumbers = 0)" name="HEFC_HECC_TESTCB" offset="0x140" rw="RW" size="4" count="16">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB"/>
        </register>
        <register caption="HECC Status register" name="HEFC_HECC_SR" offset="0x180" rw="R" size="4">
          <bitfield caption="Fixable error status" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status" mask="0x00000100" name="MEM_NOFIX"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="write or read access" mask="0x08000000" name="TYPE"/>
          <bitfield caption="memory identification number" mask="0x30000000" name="MEM_ID"/>
        </register>
