Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="HECC Interrupt Enable Register" name="HEFC_HECC_IER" offset="0x184" rw="W" size="4">
          <bitfield caption="Fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="Un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Disable Register" name="HEFC_HECC_IDR" offset="0x188" rw="W" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Mask Register" name="HEFC_HECC_IMR" offset="0x18C" rw="R" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Fail address register" name="HEFC_HECC_FAILAR" offset="0x190" rw="R" size="4">
          <bitfield caption="address of the error detected" mask="0xFFFFFFFF" name="ADDRESS"/>
        </register>
        <register caption="HECC Fail data register" name="HEFC_HECC_FAILDR" offset="0x194" rw="R" size="4">
          <bitfield caption="data of the error detected" mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="HEFC GPNVM word RC trim CRC" name="HEFC_GPNVM_TRIM_RC" offset="0x0" rw="RW" size="4">
          <bitfield caption="RC Trim CRC" mask="0xFFFFFFFF" name="RC_TRIM_CRC"/>
        </register>
        <register caption="HEFC GPNVM word RC trim" name="HEFC_GPNVM_RC_TRIM" offset="0x4" rw="RW" size="4">
          <bitfield caption="RC Temperature Trim 0" mask="0x00000003" name="RC_TTRIM0"/>
          <bitfield caption="RC Frequency Trim 0" mask="0x0000001C" name="RC_FTRIM0"/>
          <bitfield caption="RC Temperature Trim 1" mask="0x00000060" name="RC_TTRIM1"/>
          <bitfield caption="RC Frequency Trim 1" mask="0x00000380" name="RC_FTRIM1"/>
          <bitfield caption="RC Temperature Trim 2" mask="0x00000C00" name="RC_TTRIM2"/>
          <bitfield caption="RC Frequency Trim 2" mask="0x00007000" name="RC_FTRIM2"/>
        </register>
        <register caption="User Word 2" name="HEFC_GPNVM_USR2" offset="0x4" rw="RW" size="4">
          <bitfield caption="User Word 2" mask="0xFFFFFFFF" name="USR_WORD2"/>
        </register>
        <register caption="User Word 3" name="HEFC_GPNVM_USR3" offset="0x4" rw="RW" size="4">
          <bitfield caption="User Word 3" mask="0xFFFFFFFF" name="USR_WORD3"/>
        </register>
      </register-group>
      <value-group caption="Flash Command" name="HEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase page" name="EP" value="0x06"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="Flash Writing Protection Key" name="HEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="Power switch Delay" name="HEFC_FPMR__PWS_DLY">
        <value caption="delay is set to 75 usec" name="_75US" value="0x0"/>
        <value caption="delay is set to 150 usec" name="_150US" value="0x1"/>
        <value caption="delay is set to 300 usec" name="_300US" value="0x2"/>
        <value caption="delay is set to 600 usec" name="_600US" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="HEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
    </module>
    <module caption="HEMC" name="HEMC" id="44121" version="A">
      <register-group name="HEMC">
        <register caption="HEMC Control Register NCS 0" name="HEMC_CR_NCS0" offset="0x0" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
          <bitfield caption="ECC Configuration Protection Enable" mask="0x20000000" name="WRITE_ECC_CONF"/>
          <bitfield caption="ECC Protection Enable" mask="0x40000000" name="ECC_ENABLE"/>
          <bitfield caption="BCH ECC enable" mask="0x80000000" name="ECC12_ENABLE"/>
        </register>
        <register caption="HEMC Control Register NCS 1" name="HEMC_CR_NCS1" offset="0x4" rw="RW" size="4">
          <bitfield caption="fixed to 0" mask="0x00000001" name="ZERO"/>
          <bitfield caption="Bank Size" mask="0x0000003E" name="BANKSIZE" values="HEMC_CR_NCS__BANKSIZE"/>
          <bitfield caption="type of memory used" mask="0x00000040" name="TYPE"/>
          <bitfield caption="relative base address of NCS area" mask="0x01FFFF80" name="ADDBASE"/>
          <bitfield caption="ECC Protection Enable" mask="0x40000000" name="ECC_ENABLE"/>
          <bitfield caption="BCH ECC enable" mask="0x80000000" name="ECC12_ENABLE"/>
        </register>
        <register caption="HEMC Polarity Control register" name="HEMC_CTRL" offset="0x18" rw="RW" size="4">
          <bitfield caption="External control buffer active polarity" mask="0x00000001" name="POL"/>
        </register>
        <register caption="HEMC Control Register Protection NCS" name="HEMC_CRP_NCS" offset="0x20" rw="RW" size="4" count="2">
          <bitfield caption="Master Number ID" mask="0x0000FFFF" name="MASTERNUMBER"/>
          <bitfield caption="User or Superuser access" mask="0x00010000" name="SUPERUSER"/>
          <bitfield caption="Write Access" mask="0x00020000" name="WR"/>
          <bitfield caption="Read Access" mask="0x00040000" name="RD"/>
          <bitfield caption="bank size internal separation" mask="0x00F80000" name="SPLITBANKSIZE"/>
          <bitfield caption="select area protected" mask="0x01000000" name="PROTECTZONE"/>
          <bitfield caption="protection activation" mask="0x02000000" name="PROTECTON"/>
        </register>
        <register caption="HEMC Interrupt Enable Register" name="HEMC_IER" offset="0x38" rw="W" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
