Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="HEMC Interrupt Disable Register" name="HEMC_IDR" offset="0x3C" rw="W" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Interrupt Mask Register" name="HEMC_IMR" offset="0x40" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="user or superuser access error" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Interrupt Status Register" name="HEMC_ISR" offset="0x44" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="Write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="User or SuperUser Error Access" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HEMC Status Register" name="HEMC_SR" offset="0x48" rw="R" size="4">
          <bitfield caption="out of range" mask="0x00000002" name="OUTOFRANGE"/>
          <bitfield caption="Read access error" mask="0x00000004" name="RDERRORACCESS"/>
          <bitfield caption="Write access error" mask="0x00000008" name="WRERRORACCESS"/>
          <bitfield caption="User or SuperUser Error Access" mask="0x00000010" name="USERERRORACCESS"/>
        </register>
        <register caption="HECC Control Register Channel 0 (HSMC)" name="HEMC_HECC_CR" offset="0x100" rw="RW" size="4">
          <bitfield caption="test mode of ECC protection - read mode" mask="0x00000002" name="TEST_MODE_RD"/>
          <bitfield caption="test mode of ECC protection - write mode" mask="0x00000004" name="TEST_MODE_WR"/>
          <bitfield caption="reset the fixable error counter" mask="0x00000010" name="RST_FIX_CPT"/>
          <bitfield caption="reset the un-fixable error counter" mask="0x00000020" name="RST_NOFIX_CPT"/>
        </register>
        <register caption="HECC Test mode Register Channel 0 (HSMC)" name="HEMC_HECC_TESTCB" offset="0x140" rw="RW" size="4">
          <bitfield caption="test check bit (16 bit)" mask="0x0000FFFF" name="TCB1"/>
        </register>
        <register caption="HECC Status Register" name="HEMC_HECC_SR" offset="0x180" rw="R" size="4">
          <bitfield caption="Fixable error status" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="5 bits counter" mask="0x0000007C" name="CPT_FIX"/>
          <bitfield caption="counter overflow" mask="0x00000080" name="OVER_FIX"/>
          <bitfield caption="Un-fixable error status" mask="0x00000100" name="MEM_NOFIX"/>
          <bitfield caption="5 bits counter" mask="0x00007C00" name="CPT_NOFIX"/>
          <bitfield caption="counter overflow" mask="0x00008000" name="OVER_NOFIX"/>
          <bitfield caption="Hardware Error Size" mask="0x07000000" name="HES"/>
          <bitfield caption="write or read access" mask="0x08000000" name="TYPE"/>
        </register>
        <register caption="HECC Interrupt Enable Register" name="HEMC_HECC_IER" offset="0x184" rw="W" size="4">
          <bitfield caption="Fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="Un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Disable Register" name="HEMC_HECC_IDR" offset="0x188" rw="W" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Interrupt Mask Register" name="HEMC_HECC_IMR" offset="0x18C" rw="R" size="4">
          <bitfield caption="fixable error" mask="0x00000001" name="MEM_FIX"/>
          <bitfield caption="un-fixable error" mask="0x00000002" name="MEM_NOFIX"/>
        </register>
        <register caption="HECC Fail address register" name="HEMC_HECC_FAILAR" offset="0x190" rw="R" size="4">
          <bitfield caption="address of the error detected" mask="0xFFFFFFFF" name="ADDRESS"/>
        </register>
        <register caption="HECC Fail data register" name="HEMC_HECC_FAILDR" offset="0x194" rw="R" size="4">
          <bitfield caption="Data error detected" mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
      <value-group caption="Bank Size" name="HEMC_CR_NCS__BANKSIZE">
        <value caption="8Kbytes" name="_8KB" value="0x0"/>
        <value caption="16Kbytes" name="_16KB" value="0x1"/>
        <value caption="32Kbytes" name="_32KB" value="0x2"/>
        <value caption="64Kbytes" name="_64KB" value="0x3"/>
        <value caption="128Kbytes" name="_128KB" value="0x4"/>
        <value caption="256Kbytes" name="_256KB" value="0x5"/>
        <value caption="512Kbytes" name="_512KB" value="0x6"/>
        <value caption="1Mbytes" name="_1MB" value="0x7"/>
        <value caption="2Mbytes" name="_2MB" value="0x8"/>
        <value caption="NOT_USED" name="NOT_USED" value="0x1F"/>
      </value-group>
    </module>
    <module caption="Harden Static Memory Controller" name="HSMC" id="44128" version="A">
      <register-group name="HSMC_CS" size="16">
        <register caption="HSMC Setup Register" name="HSMC_SETUP" offset="0x0" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
