Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="HSMC Pulse Register" name="HSMC_PULSE" offset="0x4" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="HSMC Cycle Register" name="HSMC_CYCLE" offset="0x8" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="HSMC Mode Register" name="HSMC_MODE" offset="0xC" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="Read-Modify Write enable" mask="0x00000004" name="RMW_ENABLE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="HSMC_MODE__EXNW_MODE"/>
          <bitfield caption="Data Bus Width" mask="0x00000300" name="DBW" values="HSMC_MODE__DBW"/>
        </register>
      </register-group>
      <register-group name="HSMC">
        <register-group name="HSMC_CS" size="16" name-in-module="HSMC_CS" offset="0x0" count="2"/>
        <register caption="HSMC Write Protection Mode Register" name="HSMC_WPMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HSMC_WPMR__WPKEY"/>
        </register>
        <register caption="HSMC Write Protection Status Register" name="HSMC_WPSR" offset="0x0074" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="NWAIT Mode" name="HSMC_MODE__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="Data Bus Width" name="HSMC_MODE__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
      </value-group>
      <value-group caption="Write Protection Key" name="HSMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module caption="Integrity Check Monitor" name="ICM" id="11105" version="I">
      <register-group name="ICM">
        <register caption="Configuration Register" name="ICM_CFG" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Back Disable" mask="0x00000001" name="WBDIS"/>
          <bitfield caption="End of Monitoring Disable" mask="0x00000002" name="EOMDIS"/>
          <bitfield caption="Secondary List Branching Disable" mask="0x00000004" name="SLBDIS"/>
          <bitfield caption="Bus Burden Control" mask="0x000000F0" name="BBC"/>
          <bitfield caption="Automatic Switch To Compare Digest" mask="0x00000100" name="ASCD"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000200" name="DUALBUFF"/>
          <bitfield caption="User Initial Hash Value" mask="0x00001000" name="UIHASH"/>
          <bitfield caption="User SHA Algorithm" mask="0x0000E000" name="UALGO" values="ICM_CFG__UALGO"/>
        </register>
        <register caption="Control Register" name="ICM_CTRL" offset="0x04" rw="W" size="4">
          <bitfield caption="ICM Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="ICM Disable Register" mask="0x00000002" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000004" name="SWRST"/>
          <bitfield caption="Recompute Internal Hash" mask="0x000000F0" name="REHASH"/>
          <bitfield caption="Region Monitoring Disable" mask="0x00000F00" name="RMDIS"/>
          <bitfield caption="Region Monitoring Enable" mask="0x0000F000" name="RMEN"/>
        </register>
        <register caption="Status Register" name="ICM_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="ICM Enable Register" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Region Monitoring Disabled Raw Status" mask="0x00000F00" name="RAWRMDIS"/>
          <bitfield caption="Region Monitoring Disabled Status" mask="0x0000F000" name="RMDIS"/>
        </register>
        <register caption="Interrupt Enable Register" name="ICM_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Region Hash Completed Interrupt Enable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Enable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Enable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition detected Interrupt Enable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Enable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Enable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="ICM_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Region Hash Completed Interrupt Disable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Disable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Disable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Disable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition detected Interrupt Disable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Disable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Mask Register" name="ICM_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Region Hash Completed Interrupt Mask" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Mask" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Mask" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Mask" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Mask" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Mask" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Mask" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="ICM_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Region Hash Completed" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End Bit Condition Detected" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Detected" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Status" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Undefined Access Status Register" name="ICM_UASR" offset="0x20" rw="R" size="4">
          <bitfield caption="Undefined Register Access Trace" mask="0x00000007" name="URAT" values="ICM_UASR__URAT"/>
        </register>
        <register caption="Region Descriptor Area Start Address Register" name="ICM_DSCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Descriptor Area Start Address" mask="0xFFFFFFC0" name="DASA"/>
        </register>
