Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Region Hash Area Start Address Register" name="ICM_HASH" offset="0x34" rw="RW" size="4">
          <bitfield caption="Hash Area Start Address" mask="0xFFFFFF80" name="HASA"/>
        </register>
        <register caption="User Initial Hash Value 0 Register" name="ICM_UIHVAL" offset="0x38" rw="W" size="4" count="8">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="ICM Write Protection Mode Register" name="ICM_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ICM_WPMR__WPKEY"/>
        </register>
        <register caption="ICM Write Protection Status Register" name="ICM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (Cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <register-group caption="Region Descriptor Structure" name="ICM_DESCRIPTOR" aligned="8">
        <register caption="Region Start Address" name="RADDR" offset="0x0" rw="RW" size="4" access-size="4">
          <bitfield caption="Region Start Address" mask="0xFFFFFFFF" name="RADDR"/>
        </register>
        <register caption="Region Configuration" name="RCFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000">
          <bitfield name="CDWBN" caption="Compare Digest Write Back" mask="0x1" values="ICM_RCFG__CDWBN"/>
          <bitfield name="WRAP" caption="Region Wrap" mask="0x2" values="ICM_RCFG__WRAP"/>
          <bitfield name="EOM" caption="End of Monitoring" mask="0x4" values="ICM_RCFG__EOM"/>
          <bitfield name="RHIEN" caption="Region Hash Interrupt Enable" mask="0x10" values="ICM_RCFG__RHIEN"/>
          <bitfield name="DMIEN" caption="Region Digest Mismatch Interrupt Enable" mask="0x20" values="ICM_RCFG__DMIEN"/>
          <bitfield name="BEIEN" caption="Region Bus Error Interrupt Enable" mask="0x40" values="ICM_RCFG__BEIEN"/>
          <bitfield name="WCIEN" caption="Region Wrap Condition Detected Interrupt Enable" mask="0x80" values="ICM_RCFG__WCIEN"/>
          <bitfield name="ECIEN" caption="Region End bit Condition detected Interrupt Enable" mask="0x100" values="ICM_RCFG__ECIEN"/>
          <bitfield name="SUIEN" caption="Region Status Updated Interrupt Enable" mask="0x200" values="ICM_RCFG__SUIEN"/>
          <bitfield name="PROCDLY" caption="SHA Processing Delay" mask="0x400" values="ICM_RCFG__PROCDLY"/>
          <bitfield name="ALGO" caption="SHA Algorithm" mask="0x7000" values="ICM_RCFG__ALGO"/>
        </register>
        <register caption="Region Control" name="RCTRL" offset="0x8" rw="RW" size="4" access-size="4">
          <bitfield caption="Transfer Size for the Current Chunk of Data" mask="0x0000FFFF" name="TRSIZE"/>
        </register>
        <register caption="Region Next Address" name="RNEXT" offset="0xC" rw="RW" size="4" access-size="4">
          <bitfield caption="Region Transfer Descriptor Next Address" mask="0xFFFFFFFC" name="NEXT"/>
        </register>
      </register-group>
      <value-group caption="User SHA Algorithm" name="ICM_CFG__UALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
      <value-group caption="Undefined Register Access Trace" name="ICM_UASR__URAT">
        <value caption="Unspecified structure member set to one detected when the descriptor is loaded." name="UNSPEC_STRUCT_MEMBER" value="0x0"/>
        <value caption="ICM_CFG modified during active monitoring." name="ICM_CFG_MODIFIED" value="0x1"/>
        <value caption="ICM_DSCR modified during active monitoring." name="ICM_DSCR_MODIFIED" value="0x2"/>
        <value caption="ICM_HASH modified during active monitoring" name="ICM_HASH_MODIFIED" value="0x3"/>
        <value caption="Write-only register read access" name="READ_ACCESS" value="0x4"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ICM_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits. Always reads as 0" name="PASSWD" value="0x49434D"/>
      </value-group>
      <value-group name="ICM_RCFG__CDWBN">
        <value name="WRBA" value="0"/>
        <value name="COMP" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WRAP">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__EOM">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__DMIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__BEIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ECIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__PROCDLY">
        <value name="SHORT" value="0"/>
        <value name="LONG" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
    </module>
    <module caption="IP 1553" name="IP1553" id="44127" version="A">
      <register-group name="IP1553">
        <register caption="Configuration Register" name="IP1553_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="POTermConf" mask="0x00000001" name="PT"/>
          <bitfield caption="TermAddressConf" mask="0x0000003E" name="TA"/>
          <bitfield caption="TRBitCmd" mask="0x00000040" name="TC"/>
          <bitfield caption="SSBitCmd" mask="0x00000080" name="SC"/>
          <bitfield caption="BusyBitCmd" mask="0x00000100" name="BC"/>
          <bitfield caption="SREQBitCmd" mask="0x00000200" name="SRC"/>
          <bitfield caption="BCEnableCmd" mask="0x00000400" name="BEC"/>
          <bitfield caption="Soft Reset" mask="0x00000800" name="RST"/>
        </register>
