Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Command Register 1" name="IP1553_CMDR1" offset="0xC" rw="W" size="4">
          <bitfield caption="DATA WORD COUNT" mask="0x0000001F" name="DATAWORDCOUNT"/>
          <bitfield caption="RT SUBADDRESS" mask="0x000003E0" name="RTSUBADDRESS"/>
          <bitfield caption="T/R" mask="0x00000400" name="T_R"/>
          <bitfield caption="RT ADDRESS" mask="0x0000F800" name="RTADDRESS"/>
        </register>
        <register caption="Command Register 2" name="IP1553_CMDR2" offset="0x10" rw="W" size="4">
          <bitfield caption="DATA WORD COUNT" mask="0x0000001F" name="DATAWORDCOUNT"/>
          <bitfield caption="RT SUBADDRESS" mask="0x000003E0" name="RTSUBADDRESS"/>
          <bitfield caption="R/T" mask="0x00000400" name="T_R"/>
          <bitfield caption="RT ADDRESS" mask="0x0000F800" name="RTADDRESS"/>
        </register>
        <register caption="Command Register 3" name="IP1553_CMDR3" offset="0x14" rw="W" size="4">
          <bitfield caption="bus used" mask="0x00000001" name="BUS"/>
          <bitfield caption="1553 emitter" mask="0x00000002" name="BCE"/>
          <bitfield caption="1553 receiver" mask="0x00000004" name="BCR"/>
          <bitfield caption="data or command transfer" mask="0x00000008" name="ER"/>
        </register>
        <register caption="BIT Register" name="IP1553_BITR" offset="0x18" rw="W" size="4">
          <bitfield caption="to bit word" mask="0x0000FFFF" name="TOBITWORD"/>
        </register>
        <register caption="Vector Word Register" name="IP1553_VWR" offset="0x1C" rw="W" size="4">
          <bitfield caption="to vector word" mask="0x0000FFFF" name="TOVECTORWORD"/>
        </register>
        <register caption="IRQ Mask Enable Register" name="IP1553_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Mask Disable Register" name="IP1553_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Mask Register" name="IP1553_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
        </register>
        <register caption="IRQ Status Register" name="IP1553_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="EndMemTransfer" mask="0x00000001" name="EMT"/>
          <bitfield caption="MemTransferErr" mask="0x00000002" name="MTE"/>
          <bitfield caption="End reception" mask="0x00000004" name="ERX"/>
          <bitfield caption="EndTransmission" mask="0x00000008" name="ETX"/>
          <bitfield caption="EndTransfer" mask="0x00000030" name="ETRANS"/>
          <bitfield caption="TransErr" mask="0x00000040" name="TE"/>
          <bitfield caption="TransCodingErr" mask="0x00000080" name="TCE"/>
          <bitfield caption="TransParityErr" mask="0x00000100" name="TPE"/>
          <bitfield caption="TransDataTypeErr" mask="0x00000200" name="TDE"/>
          <bitfield caption="TransTimeOutErr" mask="0x00000400" name="TTE"/>
          <bitfield caption="TransWordCounterErr" mask="0x00000800" name="TWE"/>
          <bitfield caption="BufIFErr" mask="0x00001000" name="BE"/>
          <bitfield caption="IllegalTransferReq" mask="0x00002000" name="ITR"/>
          <bitfield caption="TransVecWordReq" mask="0x00004000" name="TVR"/>
          <bitfield caption="DynamicBusContReq" mask="0x00008000" name="DBR"/>
          <bitfield caption="InitSelfTestReq" mask="0x00010000" name="STR"/>
          <bitfield caption="TranShutdownReq" mask="0x00020000" name="TSR"/>
          <bitfield caption="OvTranShutdownReq" mask="0x00040000" name="OSR"/>
          <bitfield caption="SyncWithDataReq" mask="0x00080000" name="SDR"/>
          <bitfield caption="SyncWithoutDataReq" mask="0x00100000" name="SWD"/>
          <bitfield caption="ResetRTReq" mask="0x00200000" name="RRT"/>
          <bitfield caption="InhibitTermFlagReq" mask="0x00400000" name="ITF"/>
          <bitfield caption="OvInhibitTermFlagReq" mask="0x00800000" name="OTF"/>
          <bitfield caption="IPBusy" mask="0x01000000" name="IPB"/>
          <bitfield caption="BUS activated on last transfer" mask="0x02000000" name="BUS"/>
        </register>
        <register caption="Control Register 1" name="IP1553_CTRL1" offset="0x30" rw="R" size="4">
          <bitfield caption="IP1553 data value 1" mask="0x0000FFFF" name="IP1553DATA1"/>
          <bitfield caption="IP1553 data value 2" mask="0xFFFF0000" name="IP1553DATA2"/>
        </register>
        <register caption="Control Register 2" name="IP1553_CTRL2" offset="0x34" rw="R" size="4">
          <bitfield caption="from command register" mask="0x0000000F" name="FROMCOMMANDREG"/>
          <bitfield caption="from vector register" mask="0x000FFFF0" name="FROMVECTORWORD"/>
        </register>
        <register caption="Control Register 3" name="IP1553_CTRL3" offset="0x38" rw="R" size="4">
          <bitfield caption="content of status word register" mask="0x0000FFFF" name="FROMSTATUSWORD"/>
          <bitfield caption="content of bit word register" mask="0xFFFF0000" name="FROMBITWORD"/>
        </register>
        <register caption="Address Register Write" name="IP1553_ARW" offset="0x3C" rw="RW" size="4">
          <bitfield caption="TX base address" mask="0xFFFFFFFF" name="REG_ADDR_APB_W"/>
        </register>
        <register caption="Address Register Read" name="IP1553_ARR" offset="0x40" rw="RW" size="4">
          <bitfield caption="RX base address" mask="0xFFFFFFFF" name="REG_ADDR_APB_R"/>
        </register>
