Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Tx Buffer Status Register" name="IP1553_TXBSR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Transmit buffer 0, x with x=[0-31]" mask="0x00000001" name="TF0"/>
          <bitfield caption="Transmit buffer 1, x with x=[0-31]" mask="0x00000002" name="TF1"/>
          <bitfield caption="Transmit buffer 2, x with x=[0-31]" mask="0x00000004" name="TF2"/>
          <bitfield caption="Transmit buffer 3, x with x=[0-31]" mask="0x00000008" name="TF3"/>
          <bitfield caption="Transmit buffer 4, x with x=[0-31]" mask="0x00000010" name="TF4"/>
          <bitfield caption="Transmit buffer 5, x with x=[0-31]" mask="0x00000020" name="TF5"/>
          <bitfield caption="Transmit buffer 6, x with x=[0-31]" mask="0x00000040" name="TF6"/>
          <bitfield caption="Transmit buffer 7, x with x=[0-31]" mask="0x00000080" name="TF7"/>
          <bitfield caption="Transmit buffer 8, x with x=[0-31]" mask="0x00000100" name="TF8"/>
          <bitfield caption="Transmit buffer 9, x with x=[0-31]" mask="0x00000200" name="TF9"/>
          <bitfield caption="Transmit buffer 10, x with x=[0-31]" mask="0x00000400" name="TF10"/>
          <bitfield caption="Transmit buffer 11, x with x=[0-31]" mask="0x00000800" name="TF11"/>
          <bitfield caption="Transmit buffer 12, x with x=[0-31]" mask="0x00001000" name="TF12"/>
          <bitfield caption="Transmit buffer 13, x with x=[0-31]" mask="0x00002000" name="TF13"/>
          <bitfield caption="Transmit buffer 14, x with x=[0-31]" mask="0x00004000" name="TF14"/>
          <bitfield caption="Transmit buffer 15, x with x=[0-31]" mask="0x00008000" name="TF15"/>
          <bitfield caption="Transmit buffer 16, x with x=[0-31]" mask="0x00010000" name="TF16"/>
          <bitfield caption="Transmit buffer 17, x with x=[0-31]" mask="0x00020000" name="TF17"/>
          <bitfield caption="Transmit buffer 18, x with x=[0-31]" mask="0x00040000" name="TF18"/>
          <bitfield caption="Transmit buffer 19, x with x=[0-31]" mask="0x00080000" name="TF19"/>
          <bitfield caption="Transmit buffer 20, x with x=[0-31]" mask="0x00100000" name="TF20"/>
          <bitfield caption="Transmit buffer 21, x with x=[0-31]" mask="0x00200000" name="TF21"/>
          <bitfield caption="Transmit buffer 22, x with x=[0-31]" mask="0x00400000" name="TF22"/>
          <bitfield caption="Transmit buffer 23, x with x=[0-31]" mask="0x00800000" name="TF23"/>
          <bitfield caption="Transmit buffer 24, x with x=[0-31]" mask="0x01000000" name="TF24"/>
          <bitfield caption="Transmit buffer 25, x with x=[0-31]" mask="0x02000000" name="TF25"/>
          <bitfield caption="Transmit buffer 26, x with x=[0-31]" mask="0x04000000" name="TF26"/>
          <bitfield caption="Transmit buffer 27, x with x=[0-31]" mask="0x08000000" name="TF27"/>
          <bitfield caption="Transmit buffer 28, x with x=[0-31]" mask="0x10000000" name="TF28"/>
          <bitfield caption="Transmit buffer 29, x with x=[0-31]" mask="0x20000000" name="TF29"/>
          <bitfield caption="Transmit buffer 30, x with x=[0-31]" mask="0x40000000" name="TF30"/>
          <bitfield caption="Transmit buffer 31, x with x=[0-31]" mask="0x80000000" name="TF31"/>
        </register>
        <register caption="Tx Buffer Access Error Register" name="IP1553_TXBAER" offset="0x50" rw="RW" size="4">
          <bitfield caption="Transmit error 0, x with x=[0-31]" mask="0x00000001" name="TER0"/>
          <bitfield caption="Transmit error 1, x with x=[0-31]" mask="0x00000002" name="TER1"/>
          <bitfield caption="Transmit error 2, x with x=[0-31]" mask="0x00000004" name="TER2"/>
          <bitfield caption="Transmit error 3, x with x=[0-31]" mask="0x00000008" name="TER3"/>
          <bitfield caption="Transmit error 4, x with x=[0-31]" mask="0x00000010" name="TER4"/>
          <bitfield caption="Transmit error 5, x with x=[0-31]" mask="0x00000020" name="TER5"/>
          <bitfield caption="Transmit error 6, x with x=[0-31]" mask="0x00000040" name="TER6"/>
          <bitfield caption="Transmit error 7, x with x=[0-31]" mask="0x00000080" name="TER7"/>
          <bitfield caption="Transmit error 8, x with x=[0-31]" mask="0x00000100" name="TER8"/>
          <bitfield caption="Transmit error 9, x with x=[0-31]" mask="0x00000200" name="TER9"/>
          <bitfield caption="Transmit error 10, x with x=[0-31]" mask="0x00000400" name="TER10"/>
          <bitfield caption="Transmit error 11, x with x=[0-31]" mask="0x00000800" name="TER11"/>
          <bitfield caption="Transmit error 12, x with x=[0-31]" mask="0x00001000" name="TER12"/>
          <bitfield caption="Transmit error 13, x with x=[0-31]" mask="0x00002000" name="TER13"/>
          <bitfield caption="Transmit error 14, x with x=[0-31]" mask="0x00004000" name="TER14"/>
          <bitfield caption="Transmit error 15, x with x=[0-31]" mask="0x00008000" name="TER15"/>
          <bitfield caption="Transmit error 16, x with x=[0-31]" mask="0x00010000" name="TER16"/>
          <bitfield caption="Transmit error 17, x with x=[0-31]" mask="0x00020000" name="TER17"/>
          <bitfield caption="Transmit error 18, x with x=[0-31]" mask="0x00040000" name="TER18"/>
          <bitfield caption="Transmit error 19, x with x=[0-31]" mask="0x00080000" name="TER19"/>
          <bitfield caption="Transmit error 20, x with x=[0-31]" mask="0x00100000" name="TER20"/>
          <bitfield caption="Transmit error 21, x with x=[0-31]" mask="0x00200000" name="TER21"/>
          <bitfield caption="Transmit error 22, x with x=[0-31]" mask="0x00400000" name="TER22"/>
          <bitfield caption="Transmit error 23, x with x=[0-31]" mask="0x00800000" name="TER23"/>
          <bitfield caption="Transmit error 24, x with x=[0-31]" mask="0x01000000" name="TER24"/>
          <bitfield caption="Transmit error 25, x with x=[0-31]" mask="0x02000000" name="TER25"/>
          <bitfield caption="Transmit error 26, x with x=[0-31]" mask="0x04000000" name="TER26"/>
          <bitfield caption="Transmit error 27, x with x=[0-31]" mask="0x08000000" name="TER27"/>
          <bitfield caption="Transmit error 28, x with x=[0-31]" mask="0x10000000" name="TER28"/>
          <bitfield caption="Transmit error 29, x with x=[0-31]" mask="0x20000000" name="TER29"/>
          <bitfield caption="Transmit error 30, x with x=[0-31]" mask="0x40000000" name="TER30"/>
          <bitfield caption="Transmit error 31, x with x=[0-31]" mask="0x80000000" name="TER31"/>
        </register>
      </register-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" id="44138" version="A">
      <register-group name="MATRIX_PR" size="8">
        <register caption="Priority Register A for Slave" name="MATRIX_PRAS" offset="0x0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave" name="MATRIX_PRBS" offset="0x4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
      </register-group>
      <register-group name="MATRIX">
        <register caption="Master Configuration Register" name="MATRIX_MCFG" offset="0x0000" rw="RW" size="4" count="16">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
        <register caption="Slave Configuration Register" name="MATRIX_SCFG" offset="0x0040" rw="RW" size="4" count="16">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register-group name="MATRIX_PR" size="8" name-in-module="MATRIX_PR" offset="0x0080" count="16"/>
        <register caption="Master Remap Control Register" name="MATRIX_MRCR" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Remap Command Bit for Master 0" mask="0x00000001" name="RCB0"/>
          <bitfield caption="Remap Command Bit for Master 1" mask="0x00000002" name="RCB1"/>
          <bitfield caption="Remap Command Bit for Master 2" mask="0x00000004" name="RCB2"/>
          <bitfield caption="Remap Command Bit for Master 3" mask="0x00000008" name="RCB3"/>
          <bitfield caption="Remap Command Bit for Master 4" mask="0x00000010" name="RCB4"/>
          <bitfield caption="Remap Command Bit for Master 5" mask="0x00000020" name="RCB5"/>
          <bitfield caption="Remap Command Bit for Master 6" mask="0x00000040" name="RCB6"/>
          <bitfield caption="Remap Command Bit for Master 7" mask="0x00000080" name="RCB7"/>
          <bitfield caption="Remap Command Bit for Master 8" mask="0x00000100" name="RCB8"/>
          <bitfield caption="Remap Command Bit for Master 9" mask="0x00000200" name="RCB9"/>
          <bitfield caption="Remap Command Bit for Master 10" mask="0x00000400" name="RCB10"/>
          <bitfield caption="Remap Command Bit for Master 11" mask="0x00000800" name="RCB11"/>
          <bitfield caption="Remap Command Bit for Master 12" mask="0x00001000" name="RCB12"/>
          <bitfield caption="Remap Command Bit for Master 13" mask="0x00002000" name="RCB13"/>
          <bitfield caption="Remap Command Bit for Master 14" mask="0x00004000" name="RCB14"/>
          <bitfield caption="Remap Command Bit for Master 15" mask="0x00008000" name="RCB15"/>
        </register>
        <register caption="Master Error Interrupt Enable Register" name="MATRIX_MEIER" offset="0x0150" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Disable Register" name="MATRIX_MEIDR" offset="0x0154" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Mask Register" name="MATRIX_MEIMR" offset="0x0158" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
