Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Interrupt Active Register" name="NMIC_IAR" offset="0x08" rw="R" size="4">
          <bitfield caption="Active Interrupt 0" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Active Interrupt 1" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Active Interrupt 2" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Active Interrupt 3" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Active Interrupt 4" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Active Interrupt 5" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Active Interrupt 6" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Active Interrupt 7" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Active Interrupt 8" mask="0x00000100" name="NMI8"/>
        </register>
        <register caption="Interrupt Status Register" name="NMIC_ISR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Non-maskable Interrupt Source 0 Pending (cleared on read)" mask="0x00000001" name="NMI0"/>
          <bitfield caption="Non-maskable Interrupt Source 1 Pending (cleared on read)" mask="0x00000002" name="NMI1"/>
          <bitfield caption="Non-maskable Interrupt Source 2 Pending (cleared on read)" mask="0x00000004" name="NMI2"/>
          <bitfield caption="Non-maskable Interrupt Source 3 Pending (cleared on read)" mask="0x00000008" name="NMI3"/>
          <bitfield caption="Non-maskable Interrupt Source 4 Pending (cleared on read)" mask="0x00000010" name="NMI4"/>
          <bitfield caption="Non-maskable Interrupt Source 5 Pending (cleared on read)" mask="0x00000020" name="NMI5"/>
          <bitfield caption="Non-maskable Interrupt Source 6 Pending (cleared on read)" mask="0x00000040" name="NMI6"/>
          <bitfield caption="Non-maskable Interrupt Source 7 Pending (cleared on read)" mask="0x00000080" name="NMI7"/>
          <bitfield caption="Non-maskable Interrupt Source 8 Pending (cleared on read)" mask="0x00000100" name="NMI8"/>
        </register>
        <register caption="Glitch Filter Configuration Status Register" name="NMIC_GFCS" offset="0x10" rw="R" size="4">
          <bitfield caption="Filter 0 Configuration Ready" mask="0x00000001" name="RDY0"/>
          <bitfield caption="Filter 1 Configuration Ready" mask="0x00000002" name="RDY1"/>
          <bitfield caption="Filter 2 Configuration Ready" mask="0x00000004" name="RDY2"/>
          <bitfield caption="Filter 3 Configuration Ready" mask="0x00000008" name="RDY3"/>
          <bitfield caption="Filter 4 Configuration Ready" mask="0x00000010" name="RDY4"/>
          <bitfield caption="Filter 5 Configuration Ready" mask="0x00000020" name="RDY5"/>
          <bitfield caption="Filter 6 Configuration Ready" mask="0x00000040" name="RDY6"/>
          <bitfield caption="Filter 7 Configuration Ready" mask="0x00000080" name="RDY7"/>
          <bitfield caption="Filter 8 Configuration Ready" mask="0x00000100" name="RDY8"/>
        </register>
        <register caption="Source Configuration Register 0" name="NMIC_SCFG0R" offset="0x14" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 1" name="NMIC_SCFG1R" offset="0x18" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 2" name="NMIC_SCFG2R" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 3" name="NMIC_SCFG3R" offset="0x20" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 4" name="NMIC_SCFG4R" offset="0x24" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 5" name="NMIC_SCFG5R" offset="0x28" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 6" name="NMIC_SCFG6R" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 7" name="NMIC_SCFG7R" offset="0x30" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
        <register caption="Source Configuration Register 8" name="NMIC_SCFG8R" offset="0x34" rw="RW" size="4">
          <bitfield caption="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)" mask="0x00000003" name="GFSEL"/>
          <bitfield caption="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000010" name="GFEN"/>
          <bitfield caption="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000100" name="POL"/>
          <bitfield caption="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)" mask="0x00000200" name="LVL"/>
          <bitfield caption="Source Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Interrupt Line Freeze" mask="0x80000000" name="FRZ"/>
        </register>
