Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Write Protection Mode Register" name="NMIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPCFEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="NMIC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="NMIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Register Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Frozen Register Write Violation Status" mask="0x00000002" name="FZWVS"/>
          <bitfield caption="Busy Register Write Violation Status" mask="0x00000004" name="BSWVS"/>
          <bitfield caption="Write Violation Source" mask="0x0000FF00" name="WVSRC"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="NMIC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0." name="PASSWD" value="0x4E4D49"/>
      </value-group>
    </module>
    <module caption="Parallel Capture Controller" name="PCC" id="11276" version="A">
      <register-group name="PCC">
        <register caption="Mode Register" name="PCC_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Parallele Capture Enable" mask="0x00000001" name="PCEN"/>
          <bitfield caption="Data Size" mask="0x00000030" name="DSIZE" values="PCC_MR__DSIZE"/>
          <bitfield caption="Scale Data" mask="0x00000100" name="SCALE"/>
          <bitfield caption="Always Sampling" mask="0x00000200" name="ALWYS"/>
          <bitfield caption="Half Sampling" mask="0x00000400" name="HALFS"/>
          <bitfield caption="First Sample" mask="0x00000800" name="FRSTS"/>
          <bitfield caption="Input Data Size" mask="0x00070000" name="ISIZE" values="PCC_MR__ISIZE"/>
          <bitfield caption="Clear If Disabled" mask="0xC0000000" name="CID" values="PCC_MR__CID"/>
        </register>
        <register caption="Interrupt Enable Register" name="PCC_IER" offset="0x04" rw="W" size="4" atomic-op="set:PCC_IMR">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="PCC_IDR" offset="0x08" rw="W" size="4" atomic-op="clear:PCC_IMR">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Interrupt Mask Register" name="PCC_IMR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Interrupt Status Register" name="PCC_ISR" offset="0x10" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Overrun Error." mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Reception Holding Register" name="PCC_RHR" offset="0x14" rw="R" size="4">
          <bitfield caption="Reception Data." mask="0xFFFFFFFF" name="RDATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="PCC_WPMR" offset="0xE0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key." mask="0xFFFFFF00" name="WPKEY" values="PCC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PCC_WPSR" offset="0xE4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Data Size" name="PCC_MR__DSIZE">
        <value caption="1 data is read in the PCC_RHR" name="1_DATA" value="0x0"/>
        <value caption="2 data are read in the PCC_RHR" name="2_DATA" value="0x1"/>
        <value caption="4 data are read in the PCC_RHR (only for 8 bits data size, ISIZE = 0)" name="4_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Input Data Size" name="PCC_MR__ISIZE">
        <value caption="Input data bus size is 8 bits" name="8_BITS" value="0x0"/>
        <value caption="Input data bus size is 10 bits" name="10_BITS" value="0x1"/>
        <value caption="Input data bus size is 12 bits" name="12_BITS" value="0x2"/>
        <value caption="Input data bus size is 14 bits" name="14_BITS" value="0x3"/>
        <value caption="Input data bus size is 16 bits" name="16_BITS" value="0x4"/>
      </value-group>
      <value-group caption="Clear If Disabled" name="PCC_MR__CID">
        <value caption="Clear not enabled" name="NONE" value="0x0"/>
        <value caption="Clear on falling edge on DEN1 enabled" name="DEN1" value="0x1"/>
        <value caption="Clear on falling edge on DEN2 enabled" name="DEN2" value="0x2"/>
        <value caption="Clear on falling edge on either DEN1 or DEN2 enabled" name="EITHER" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key." name="PCC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504343"/>
      </value-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" id="11264" version="K">
      <register-group name="PIO_GROUP" size="64">
        <register caption="PIO Mask Register" name="PIO_MSKR" offset="0x0" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="PIO_MSKR__MSK"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="PIO_MSKR__MSK"/>
        </register>
