Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="PIO Interrupt Disable Register" name="PIO_IDR" offset="0x24" rw="W" size="4" atomic-op="clear:PIO_IMR">
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Interrupt Mask Register" name="PIO_IMR" offset="0x28" rw="R" size="4" atomic-op="read:PIO_IMR">
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Interrupt Status Register" name="PIO_ISR" offset="0x2C" rw="R" size="4" atomic-op="clear:PIO_ISR">
          <bitfield caption="Input Change Interrupt Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO I/O Freeze Configuration Register" name="PIO_IOFR" offset="0x3C" rw="W" size="4">
          <bitfield caption="Freeze Physical Configuration" mask="0x00000001" name="FPHY"/>
          <bitfield caption="Freeze Interrupt Configuration" mask="0x00000002" name="FINT"/>
          <bitfield caption="Freeze Key" mask="0xFFFFFF00" name="FRZKEY" values="PIO_IOFR__FRZKEY"/>
        </register>
      </register-group>
      <register-group name="PIO">
        <register-group name="PIO_GROUP" size="64" name-in-module="PIO_GROUP" offset="0x0" count="4"/>
        <register caption="PIO Slow Clock Divider Debouncing Register" name="PIO_SCDR" offset="0x500" rw="RW" size="4">
          <bitfield caption="Slow Clock Divider Selection for Debouncing" mask="0x00003FFF" name="DIV"/>
        </register>
        <register caption="PIO Write Protection Mode Register" name="PIO_WPMR" offset="0x5E0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PIO_WPMR__WPKEY"/>
        </register>
        <register caption="PIO Write Protection Status Register" name="PIO_WPSR" offset="0x5E4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
