Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="PIO Line Mask" name="PIO_MSKR__MSK">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="I/O Line Function" name="PIO_CFGR__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
        <value caption="Select the peripheral E for the selected I/O lines." name="PERIPH_E" value="0x5"/>
        <value caption="Select the peripheral F for the selected I/O lines." name="PERIPH_F" value="0x6"/>
        <value caption="Select the peripheral G for the selected I/O lines." name="PERIPH_G" value="0x7"/>
      </value-group>
      <value-group caption="Direction" name="PIO_CFGR__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="PIO_CFGR__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Pull-Down Enable" name="PIO_CFGR__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Open-Drain" name="PIO_CFGR__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Schmitt Trigger" name="PIO_CFGR__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="Drive Strength" name="PIO_CFGR__DRVSTR">
        <value caption="Output drive is 2mA" name="OUT_2m" value="0x0"/>
        <value caption="Output drive is 4mA" name="OUT_4m" value="0x1"/>
        <value caption="Output drive is 8mA" name="OUT_8m" value="0x2"/>
        <value caption="Output drive is 16mA" name="OUT_16m" value="0x3"/>
        <value caption="Output drive is 24mA" name="OUT_24m" value="0x4"/>
        <value caption="Output drive is 32mA" name="OUT_32m" value="0x5"/>
        <value caption="Output drive is 40mA" name="OUT_40m" value="0x6"/>
        <value caption="Output drive is 48mA" name="OUT_48m" value="0x7"/>
      </value-group>
      <value-group caption="Event Selection" name="PIO_CFGR__EVTSEL">
        <value caption="Event detection on input falling edge" name="FALLING" value="0x0"/>
        <value caption="Event detection on input rising edge" name="RISING" value="0x1"/>
        <value caption="Event detection on input both edge" name="BOTH" value="0x2"/>
        <value caption="Event detection on low level input" name="LOW" value="0x3"/>
        <value caption="Event detection on high level input" name="HIGH" value="0x4"/>
      </value-group>
      <value-group caption="Physical Configuration Freeze Status (read-only)" name="PIO_CFGR__PCFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Interrupt Configuration Freeze Status (read-only)" name="PIO_CFGR__ICFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Freeze Key" name="PIO_IOFR__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit." name="PASSWD" value="0x494F46"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
    </module>
    <module caption="Power Management Controller" name="PMC" id="44113" version="A">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Enable" mask="0x00000800" name="PCK3"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Disable" mask="0x00000800" name="PCK3"/>
        </register>
