Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="System Clock Status Register" name="PMC_SCSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Programmable Clock 0 Output Status" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Status" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Status" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Status" mask="0x00000800" name="PCK3"/>
        </register>
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="Shall be always write at '0'" mask="0x00000002" name="ZERO"/>
          <bitfield caption="Main RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main RC Oscillator Frequency Selection" mask="0x00000070" name="MOSCRCF" values="CKGR_MOR__MOSCRCF"/>
          <bitfield caption="Main Crystal Oscillator Startup Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Write Access Password" mask="0x00FF0000" name="KEY" values="CKGR_MOR__KEY"/>
          <bitfield caption="Main Clock Oscillator Selection" mask="0x01000000" name="MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
          <bitfield caption="32.768 kHz External Slow clock Frequency Monitoring Enable" mask="0x04000000" name="EXT32KFME"/>
          <bitfield caption="Bad CPU Clock Reset Enable" mask="0x08000000" name="BCPURST"/>
          <bitfield caption="Bad CPU Clock Interrupt to NMIC Enable" mask="0x10000000" name="BCPUNMIC"/>
        </register>
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Frequency Measure Ready" mask="0x00010000" name="MAINFRDY"/>
          <bitfield caption="RC Oscillator Frequency Measure (write-only)" mask="0x00100000" name="RCMEAS"/>
          <bitfield caption="Counter Clock Source Selection" mask="0x01000000" name="CCSS"/>
        </register>
        <register caption="PLLA Register" name="CKGR_PLLAR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="PLLA Front End Divider" mask="0x000000FF" name="DIVA" values="CKGR_PLLAR__DIVA"/>
          <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
          <bitfield caption="VCO Frequency Configuratio" mask="0x0000C000" name="FREQ_VCO" values="CKGR_PLLAR__FREQ_VCO"/>
          <bitfield caption="PLLA Multiplier" mask="0x07FF0000" name="MULA"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
        </register>
        <register caption="PLLB Register" name="CKGR_PLLBR" offset="0x002C" rw="RW" size="4">
          <bitfield caption="PLLB Front End Divider" mask="0x000000FF" name="DIVB" values="CKGR_PLLBR__DIVB"/>
          <bitfield caption="PLLB Counter" mask="0x00003F00" name="PLLBCOUNT"/>
          <bitfield caption="VCO Frequency Configuration" mask="0x0000C000" name="FREQ_VCO" values="CKGR_PLLBR__FREQ_VCO"/>
          <bitfield caption="PLLB Multiplier" mask="0x07FF0000" name="MULB"/>
          <bitfield caption="PLLB Source Clock Selection" mask="0x60000000" name="SRCB" values="CKGR_PLLBR__SRCB"/>
        </register>
        <register caption="Master Clock Register" name="PMC_MCKR" offset="0x0030" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000003" name="CSS" values="PMC_MCKR__CSS"/>
          <bitfield caption="Processor Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_MCKR__PRES"/>
          <bitfield caption="Master Clock Division" mask="0x00000100" name="MDIV" values="PMC_MCKR__MDIV"/>
          <bitfield caption="Shall be always write at '0'" mask="0x00002000" name="ZERO"/>
        </register>
        <register caption="Programmable Clock Register" name="PMC_PCK" offset="0x40" rw="RW" size="4" count="4">
          <bitfield caption="Programmable Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000FF0" name="PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Enable" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Enable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Oscillator Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz external slow clock Error Interrupt Enable" mask="0x00200000" name="EXT32KERR"/>
          <bitfield caption="CPU Clock Monitor Interrupt Enable" mask="0x00800000" name="CPUMON"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Disable" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Disable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz external slow clock Error Interrupt Disable" mask="0x00200000" name="EXT32KERR"/>
          <bitfield caption="CPU Clock Monitor Interrupt Disable" mask="0x00800000" name="CPUMON"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Status" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Monitoring Domain Slow Clock Source Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
          <bitfield caption="External Slow Clock Error" mask="0x00200000" name="EXT32KERR"/>
          <bitfield caption="CPU Clock Monitor Error" mask="0x00800000" name="CPUMON"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Mask" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Mask" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz Slow Clock Error Interrupt Mask" mask="0x00200000" name="EXT32KERR"/>
          <bitfield caption="CPU Clock Monitor Error Interrupt Mask" mask="0x00800000" name="CPUMON"/>
        </register>
