Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="PLL Configuration Register" name="PMC_PLL_CFG" offset="0x0080" rw="RW" size="4">
          <bitfield caption="PLLA Output Current" mask="0x0000000F" name="OUTCUR_PLLA" values="PMC_PLL_CFG__OUTCUR_PLLA"/>
          <bitfield caption="Internal Filter PLL - Select Internal Capaticance Value" mask="0x00003000" name="SCA" values="PMC_PLL_CFG__SCA"/>
          <bitfield caption="Internal Filter PLL - Select Internal Resistor Value" mask="0x0000C000" name="SRA" values="PMC_PLL_CFG__SRA"/>
          <bitfield caption="PLLB Output Current" mask="0x000F0000" name="OUTCUR_PLLB" values="PMC_PLL_CFG__OUTCUR_PLLB"/>
          <bitfield caption="Internal Filter PLL - Select Internal Capaticance Value" mask="0x30000000" name="SCB" values="PMC_PLL_CFG__SCB"/>
          <bitfield caption="Internal Filter PLL - Select Internal Resistor Value" mask="0xC0000000" name="SRB" values="PMC_PLL_CFG__SRB"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x010C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000007F" name="PID"/>
          <bitfield caption="Generic Clock Source Selection" mask="0x00000700" name="GCLKCSS" values="PMC_PCR__GCLKCSS"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Generic Clock Division Ratio" mask="0x0FF00000" name="GCLKDIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
          <bitfield caption="Generic Clock Enable" mask="0x20000000" name="GCLKEN"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR1" offset="0x0110" rw="RW" size="4">
          <bitfield caption="Main RC Oscillator Calibration Bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 12 MHz" mask="0x007F0000" name="CAL12"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 10 MHz" mask="0x00800000" name="SEL10"/>
          <bitfield caption="Main RC Oscillator Calibration Bits for 10 MHz" mask="0x7F000000" name="CAL10"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits for 12 MHz" mask="0x80000000" name="SEL12"/>
        </register>
        <register caption="PLL Maximum Multiplier Value Register" name="PMC_PMMR" offset="0x0130" rw="RW" size="4">
          <bitfield caption="PLLA Maximum Allowed Multiplier Value" mask="0x000007FF" name="PLLA_MMAX"/>
          <bitfield caption="PLLB Maximum Allowed Multiplier Value" mask="0x07FF0000" name="PLLB_MMAX"/>
        </register>
        <register caption="CPU Monitor Limits Register" name="PMC_CPULIM" offset="0x0160" rw="RW" size="4">
          <bitfield caption="CPU Monitoring Low IT Limit" mask="0x000000FF" name="CPU_LOW_IT"/>
          <bitfield caption="CPU Monitoring High IT Limit" mask="0x0000FF00" name="CPU_HIGH_IT"/>
          <bitfield caption="CPU Monitoring Low RESET Limit" mask="0x00FF0000" name="CPU_LOW_RES"/>
          <bitfield caption="CPU Monitoring High Reset Limit" mask="0xFF000000" name="CPU_HIGH_RES"/>
        </register>
        <register caption="Peripheral Clock Status Register 0" name="PMC_CSR0" offset="0x0170" rw="R" size="4">
          <bitfield caption="Peripheral Clock 7 Status" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 22 Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_CSR1" offset="0x0174" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 50 Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 53 Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 54 Status" mask="0x00400000" name="PID54"/>
          <bitfield caption="Peripheral Clock 55 Status" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 59 Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 63 Status" mask="0x80000000" name="PID63"/>
        </register>
        <register caption="Peripheral Clock Status Register 2" name="PMC_CSR2" offset="0x0178" rw="R" size="4">
          <bitfield caption="Peripheral Clock 64 Status" mask="0x00000001" name="PID64"/>
          <bitfield caption="Peripheral Clock 65 Status" mask="0x00000002" name="PID65"/>
          <bitfield caption="Peripheral Clock 66 Status" mask="0x00000004" name="PID66"/>
          <bitfield caption="Peripheral Clock 68 Status" mask="0x00000010" name="PID68"/>
        </register>
        <register caption="Peripheral Clock Status Register 3" name="PMC_CSR3" offset="0x017C" rw="R" size="4"/>
        <register caption="Generic Clock Status Register 0" name="PMC_GCSR0" offset="0x0190" rw="R" size="4">
          <bitfield caption="Generic Clock 7 Status" mask="0x00000080" name="GPID7"/>
          <bitfield caption="Generic Clock 8 Status" mask="0x00000100" name="GPID8"/>
          <bitfield caption="Generic Clock 9 Status" mask="0x00000200" name="GPID9"/>
          <bitfield caption="Generic Clock 13 Status" mask="0x00002000" name="GPID13"/>
          <bitfield caption="Generic Clock 14 Status" mask="0x00004000" name="GPID14"/>
          <bitfield caption="Generic Clock 23 Status" mask="0x00800000" name="GPID23"/>
          <bitfield caption="Generic Clock 25 Status" mask="0x02000000" name="GPID25"/>
          <bitfield caption="Generic Clock 28 Status" mask="0x10000000" name="GPID28"/>
        </register>
        <register caption="Generic Clock Status Register 1" name="PMC_GCSR1" offset="0x0194" rw="R" size="4">
          <bitfield caption="Generic Clock 36 Status" mask="0x00000010" name="GPID36"/>
          <bitfield caption="Generic Clock 38 Status" mask="0x00000040" name="GPID38"/>
          <bitfield caption="Generic Clock 50 Status" mask="0x00040000" name="GPID50"/>
          <bitfield caption="Generic Clock 53 Status" mask="0x00200000" name="GPID53"/>
        </register>
        <register caption="Generic Clock Status Register 2" name="PMC_GCSR2" offset="0x0198" rw="R" size="4">
          <bitfield caption="Generic Clock 65 Status" mask="0x00000002" name="GPID65"/>
          <bitfield caption="Generic Clock 66 Status" mask="0x00000004" name="GPID66"/>
          <bitfield caption="Generic Clock 68 Status" mask="0x00000010" name="GPID68"/>
        </register>
        <register caption="Generic Clock Status Register 3" name="PMC_GCSR3" offset="0x019C" rw="R" size="4"/>
        <register caption="Oscillator Control Register 2" name="PMC_OSC2" offset="0x01B0" rw="RW" size="4">
          <bitfield caption="Enable" mask="0x00000001" name="EN"/>
          <bitfield caption="2nd Oscillator Frequency Selection" mask="0x00000030" name="OSCRCF" values="PMC_OSC2__OSCRCF"/>
          <bitfield caption="Enable Calibration Register Write" mask="0x00000100" name="EN_WR_CALIB"/>
          <bitfield caption="Register Write Access Password" mask="0x00FF0000" name="KEY" values="PMC_OSC2__KEY"/>
        </register>
