Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="PWM Spread Spectrum Update Register" name="PWM_SSPUP" offset="0xA4" rw="W" size="4">
          <bitfield caption="Spread Spectrum Limit Value Update" mask="0x00FFFFFF" name="SPRDUP"/>
        </register>
        <register caption="PWM Stepper Motor Mode Register" name="PWM_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count Enable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="Down Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="Down Count" mask="0x00020000" name="DOWN1"/>
        </register>
        <register caption="PWM Fault Protection Value 2 Register" name="PWM_FPV2" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 0" mask="0x00000001" name="FPZH0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 1" mask="0x00000002" name="FPZH1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 2" mask="0x00000004" name="FPZH2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 3" mask="0x00000008" name="FPZH3"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 0" mask="0x00010000" name="FPZL0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 1" mask="0x00020000" name="FPZL1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 2" mask="0x00040000" name="FPZL2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 3" mask="0x00080000" name="FPZL3"/>
        </register>
        <register caption="PWM Write Protection Control Register" name="PWM_WPCR" offset="0xE4" rw="W" size="4">
          <bitfield caption="Write Protection Command" mask="0x00000003" name="WPCMD" values="PWM_WPCR__WPCMD"/>
          <bitfield caption="Write Protection Register Group 0" mask="0x00000004" name="WPRG0"/>
          <bitfield caption="Write Protection Register Group 1" mask="0x00000008" name="WPRG1"/>
          <bitfield caption="Write Protection Register Group 2" mask="0x00000010" name="WPRG2"/>
          <bitfield caption="Write Protection Register Group 3" mask="0x00000020" name="WPRG3"/>
          <bitfield caption="Write Protection Register Group 4" mask="0x00000040" name="WPRG4"/>
          <bitfield caption="Write Protection Register Group 5" mask="0x00000080" name="WPRG5"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PWM_WPCR__WPKEY"/>
        </register>
        <register caption="PWM Write Protection Status Register" name="PWM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect SW Status" mask="0x00000001" name="WPSWS0"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000002" name="WPSWS1"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000004" name="WPSWS2"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000008" name="WPSWS3"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000010" name="WPSWS4"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000020" name="WPSWS5"/>
          <bitfield caption="Write Protect Violation Status" mask="0x00000080" name="WPVS"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000100" name="WPHWS0"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000200" name="WPHWS1"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000400" name="WPHWS2"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000800" name="WPHWS3"/>
          <bitfield caption="Write Protect HW Status" mask="0x00001000" name="WPHWS4"/>
          <bitfield caption="Write Protect HW Status" mask="0x00002000" name="WPHWS5"/>
          <bitfield caption="Write Protect Violation Source" mask="0xFFFF0000" name="WPVSRC"/>
        </register>
        <register-group caption="PWM Comparison Value Register" name="PWM_CMP" size="16" name-in-module="PWM_CMP" offset="0x130" count="8"/>
        <register-group caption="PWM Channel Mode Register" name="PWM_CH_NUM" size="32" name-in-module="PWM_CH_NUM" offset="0x200" count="4"/>
        <register caption="PWM Channel Mode Update Register (ch_num = 0)" name="PWM_CMUPD0" offset="0x400" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM Channel Mode Update Register (ch_num = 1)" name="PWM_CMUPD1" offset="0x420" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM External Trigger Register (trg_num = 1)" name="PWM_ETRG1" offset="0x42C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWM_ETRG1__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWM_ETRG1__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
        <register caption="PWM Leading-Edge Blanking Register (trg_num = 1)" name="PWM_LEBR1" offset="0x430" rw="RW" size="4">
          <bitfield caption="Leading-Edge Blanking Delay for TRGINx" mask="0x0000007F" name="LEBDELAY"/>
          <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
          <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
          <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
          <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
        </register>
        <register caption="PWM Channel Mode Update Register (ch_num = 2)" name="PWM_CMUPD2" offset="0x440" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM External Trigger Register (trg_num = 2)" name="PWM_ETRG2" offset="0x44C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWM_ETRG2__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWM_ETRG2__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
        <register caption="PWM Leading-Edge Blanking Register (trg_num = 2)" name="PWM_LEBR2" offset="0x450" rw="RW" size="4">
          <bitfield caption="Leading-Edge Blanking Delay for TRGINx" mask="0x0000007F" name="LEBDELAY"/>
          <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
          <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
          <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
          <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
        </register>
        <register caption="PWM Channel Mode Update Register (ch_num = 3)" name="PWM_CMUPD3" offset="0x460" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
      </register-group>
      <value-group caption="Channel Prescaler" name="PWM_CMR__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
