Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="CLKA Divide Factor" name="PWM_CLK__DIVA">
        <value caption="CLKA clock is turned off" name="CLKA_POFF" value="0"/>
        <value caption="CLKA clock is clock selected by PREA" name="PREA" value="1"/>
      </value-group>
      <value-group caption="CLKA Source Clock Selection" name="PWM_CLK__PREA">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="CLKB Divide Factor" name="PWM_CLK__DIVB">
        <value caption="CLKB clock is turned off" name="CLKB_POFF" value="0"/>
        <value caption="CLKB clock is clock selected by PREB" name="PREB" value="1"/>
      </value-group>
      <value-group caption="CLKB Source Clock Selection" name="PWM_CLK__PREB">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="Synchronous Channels Update Mode" name="PWM_SCM__UPDM">
        <value caption="Manual write of double buffer registers and manual update of synchronous channels" name="MODE0" value="0x0"/>
        <value caption="Manual write of double buffer registers and automatic update of synchronous channels" name="MODE1" value="0x1"/>
        <value caption="Automatic write of duty-cycle update registers by the DMA Controller and automatic update of synchronous channels" name="MODE2" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Command" name="PWM_WPCR__WPCMD">
        <value caption="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." name="DISABLE_SW_PROT" value="0x0"/>
        <value caption="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." name="ENABLE_SW_PROT" value="0x1"/>
        <value caption="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." name="ENABLE_HW_PROT" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PWM_WPCR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCMD field. Always reads as 0" name="PASSWD" value="0x50574D"/>
      </value-group>
      <value-group caption="Channel Alignment" name="PWM_CMR__CALG">
        <value caption="Left aligned" name="LEFT_ALIGNED" value="0x0"/>
        <value caption="Center aligned" name="CENTER_ALIGNED" value="0x1"/>
      </value-group>
      <value-group caption="Channel Polarity" name="PWM_CMR__CPOL">
        <value caption="Waveform starts at low level" name="LOW_POLARITY" value="0x0"/>
        <value caption="Waveform starts at high level" name="HIGH_POLARITY" value="0x1"/>
      </value-group>
      <value-group caption="Counter Event Selection" name="PWM_CMR__CES">
        <value caption="At the end of PWM period" name="SINGLE_EVENT" value="0x0"/>
        <value caption="At half of PWM period AND at the end of PWM period" name="DOUBLE_EVENT" value="0x1"/>
      </value-group>
      <value-group caption="Update Selection" name="PWM_CMR__UPDS">
        <value caption="At the next end of PWM period" name="UPDATE_AT_PERIOD" value="0x0"/>
        <value caption="At the next end of Half PWM period" name="UPDATE_AT_HALF_PERIOD" value="0x1"/>
      </value-group>
      <value-group caption="Comparison Value Mode" name="PWM_CMPV__CVM">
        <value caption="Compare when counter is incrementing" name="COMPARE_AT_INCREMENT" value="0x0"/>
        <value caption="Compare when counter is decrementing" name="COMPARE_AT_DECREMENT" value="0x1"/>
      </value-group>
      <value-group caption="External Trigger Mode" name="PWM_ETRG1__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="Edge Selection" name="PWM_ETRG1__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge. TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge. TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
      <value-group caption="External Trigger Mode" name="PWM_ETRG2__TRGMODE">
        <value caption="External trigger is not enabled." name="OFF" value="0x0"/>
        <value caption="External PWM Reset Mode" name="MODE1" value="0x1"/>
        <value caption="External PWM Start Mode" name="MODE2" value="0x2"/>
        <value caption="Cycle-by-cycle Duty Mode" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="Edge Selection" name="PWM_ETRG2__TRGEDGE">
        <value caption="TRGMODE = 1: TRGINx event detection on falling edge. TRGMODE = 2, 3: TRGINx active level is 0" name="FALLING_ZERO" value="0"/>
        <value caption="TRGMODE = 1: TRGINx event detection on rising edge. TRGMODE = 2, 3: TRGINx active level is 1" name="RISING_ONE" value="1"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" id="11009" version="N">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="External Reset" mask="0x00000010" name="PERIIDON"/>
          <bitfield caption="Peripheral Identifier" mask="0x0000FF00" name="PERIID"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
