Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="CAN1 MSB Base Address" name="SFR_CAN1" offset="0xA4" rw="RW" size="4">
          <bitfield caption="MSB Base Address" mask="0xFFFF0000" name="EXT_MEM_ADDR"/>
        </register>
        <register caption="BOOT Configuration" name="SFR_BOOT_CFG" offset="0xB0" rw="RW" size="4">
          <bitfield caption="BOOT_MODE selected" mask="0x00000007" name="BOOT_SEL"/>
        </register>
        <register caption="Write Protection Mode Register" name="SFR_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SFR_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="SFR_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534652"/>
      </value-group>
    </module>
    <module caption="Secure Hash Algorithm" name="SHA" id="6156" version="O">
      <register-group name="SHA">
        <register caption="Control Register" name="SHA_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="First Block of a Message" mask="0x00000010" name="FIRST"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Write User Initial Hash Values" mask="0x00001000" name="WUIHV"/>
          <bitfield caption="Write User Initial or Expected Hash Values" mask="0x00002000" name="WUIEHV"/>
        </register>
        <register caption="Mode Register" name="SHA_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Start Mode" mask="0x00000003" name="SMOD" values="SHA_MR__SMOD"/>
          <bitfield caption="User Initial Hash Value Registers" mask="0x00000020" name="UIHV"/>
          <bitfield caption="User Initial or Expected Hash Value Registers" mask="0x00000040" name="UIEHV"/>
          <bitfield caption="SHA Algorithm" mask="0x00000F00" name="ALGO" values="SHA_MR__ALGO"/>
          <bitfield caption="Dual Input Buffer" mask="0x00010000" name="DUALBUFF" values="SHA_MR__DUALBUFF"/>
          <bitfield caption="Hash Check" mask="0x03000000" name="CHECK" values="SHA_MR__CHECK"/>
          <bitfield caption="Check Counter" mask="0xF0000000" name="CHKCNT"/>
        </register>
        <register caption="Interrupt Enable Register" name="SHA_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Enable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Enable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Disable Register" name="SHA_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Disable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Disable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="SHA_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Mask" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Safety Event Interrupt Mask" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Status Register" name="SHA_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Input Data Register Write Ready" mask="0x00000010" name="WRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00007000" name="URAT"/>
          <bitfield caption="Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00F00000" name="CHKST"/>
          <bitfield caption="Security and/or Safety Event" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Message Size Register" name="SHA_MSR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Message Size" mask="0xFFFFFFFF" name="MSGSIZE"/>
        </register>
        <register caption="Bytes Count Register" name="SHA_BCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Remaining Byte Count Before Auto Padding" mask="0xFFFFFFFF" name="BYTCNT"/>
        </register>
        <register caption="Input Data 0 Register" name="SHA_IDATAR" offset="0x40" rw="W" size="4" count="16">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input/Output Data 0 Register" name="SHA_IODATAR" offset="0x80" rw="RW" size="4" count="16">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
        <register caption="Write Protection Mode Register" name="SHA_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SHA_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SHA_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Start Mode" name="SHA_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="SHA_IDATAR0 access only mode (mandatory when DMA is used)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="SHA Algorithm" name="SHA_MR__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA384 algorithm processed" name="SHA384" value="0x2"/>
        <value caption="SHA512 algorithm processed" name="SHA512" value="0x3"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
        <value caption="HMAC algorithm with SHA1 Hash processed" name="HMAC_SHA1" value="0x8"/>
        <value caption="HMAC algorithm with SHA256 Hash processed" name="HMAC_SHA256" value="0x9"/>
        <value caption="HMAC algorithm with SHA384 Hash processed" name="HMAC_SHA384" value="0xA"/>
        <value caption="HMAC algorithm with SHA512 Hash processed" name="HMAC_SHA512" value="0xB"/>
        <value caption="HMAC algorithm with SHA224 Hash processed" name="HMAC_SHA224" value="0xC"/>
      </value-group>
      <value-group caption="Dual Input Buffer" name="SHA_MR__DUALBUFF">
        <value caption="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="Hash Check" name="SHA_MR__CHECK">
        <value caption="No check is performed" name="NO_CHECK" value="0x0"/>
        <value caption="Check is performed with expected hash stored in internal expected hash value registers." name="CHECK_EHV" value="0x1"/>
        <value caption="Check is performed with expected hash provided after the message." name="CHECK_MESSAGE" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="SHA_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." name="PASSWD" value="0x534841"/>
      </value-group>
    </module>
    <module caption="SpW" name="SPW" id="44126" version="B">
      <register-group name="SPW">
        <register caption="SpW Router Status" name="SPW_ROUTER_STS" offset="0x0000" rw="R" size="4">
          <bitfield caption="Destination addr" mask="0x0000001F" name="DEST"/>
          <bitfield caption="Source address" mask="0x00001F00" name="SOURCE"/>
          <bitfield caption="Router byte" mask="0x00FF0000" name="BYTE"/>
          <bitfield caption="Packet Count" mask="0xFF000000" name="COUNT"/>
        </register>
        <register caption="SpW Router Config" name="SPW_ROUTER_CFG" offset="0x0004" rw="RW" size="4">
          <bitfield caption="LA Routing Enable" mask="0x00000001" name="LAENA"/>
          <bitfield caption="Fallback Routing" mask="0x00000002" name="FALLBACK"/>
          <bitfield caption="Disable Timeout" mask="0x00000004" name="DISTIMEOUT"/>
        </register>
        <register caption="SpW Router Timeout" name="SPW_ROUTER_TIMEOUT" offset="0x0008" rw="R" size="4">
          <bitfield caption="Physical Address" mask="0x0000001F" name="ADDR"/>
          <bitfield caption="Locked" mask="0x80000000" name="LOCKED"/>
        </register>
        <register caption="SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32)" name="SPW_ROUTER_TABLE" offset="0x80" rw="RW" size="4" count="224">
          <bitfield caption="Address" mask="0x0000001F" name="ADDR"/>
          <bitfield caption="Delete Header Byte" mask="0x00000100" name="DELHEAD"/>
        </register>
        <register caption="SpW Link 1 Pending Read Masked Interrupt" name="SPW_LINK1_PI_RM" offset="0x400" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
