Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SpW Link 1 Pending Read Interrupt" name="SPW_LINK1_PI_R" offset="0x408" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Pending Read, Clear and Enabed Interrupt" name="SPW_LINK1_PI_RCS" offset="0x40C" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Interrupt Mask" name="SPW_LINK1_IM" offset="0x410" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Clear Pending Interrupt" name="SPW_LINK1_PI_C" offset="0x414" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Interrupt Set Mask" name="SPW_LINK1_IM_S" offset="0x418" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Interrupt Clear Mask" name="SPW_LINK1_IM_C" offset="0x41C" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 1 Config" name="SPW_LINK1_CFG" offset="0x420" rw="RW" size="4">
          <bitfield caption="Command" mask="0x00000003" name="COMMAND" values="SPW_LINK1_CFG__COMMAND"/>
        </register>
        <register caption="SpW Link 1 Clock Division" name="SPW_LINK1_CLKDIV" offset="0x424" rw="RW" size="4">
          <bitfield caption="TxOperDiv" mask="0x0000001F" name="TXOPERDIV"/>
          <bitfield caption="TxInitDiv" mask="0x001F0000" name="TXINITDIV"/>
        </register>
        <register caption="SpW Link 1 Status" name="SPW_LINK1_STATUS" offset="0x428" rw="R" size="4">
          <bitfield caption="LinkState" mask="0x00000007" name="LINKSTATE" values="SPW_LINK1_STATUS__LINKSTATE"/>
          <bitfield caption="TxDefDiv" mask="0x000001F0" name="TXDEFDIV"/>
          <bitfield caption="TxEmpty" mask="0x00010000" name="TXEMPTY"/>
          <bitfield caption="GotNull" mask="0x00020000" name="GOTNULL"/>
          <bitfield caption="GotFCT" mask="0x00040000" name="GOTFCT"/>
          <bitfield caption="GotNChar" mask="0x00080000" name="GOTNCHAR"/>
          <bitfield caption="SEEN0" mask="0x00100000" name="SEEN0"/>
          <bitfield caption="SEEN1" mask="0x00200000" name="SEEN1"/>
          <bitfield caption="SEEN2" mask="0x00400000" name="SEEN2"/>
          <bitfield caption="SEEN3" mask="0x00800000" name="SEEN3"/>
          <bitfield caption="SEEN4" mask="0x01000000" name="SEEN4"/>
          <bitfield caption="SEEN5" mask="0x02000000" name="SEEN5"/>
        </register>
