Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SpW Link 1 Software Reset" name="SPW_LINK1_SWRESET" offset="0x42C" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="SpW Link 1 Escape Character Event" name="SPW_LINK1_ESCCHAREVENT" offset="0x430" rw="RW" size="4" count="2">
          <bitfield caption="Value" mask="0x000000FF" name="VALUE"/>
          <bitfield caption="Mask" mask="0x0000FF00" name="MASK"/>
          <bitfield caption="Active" mask="0x00010000" name="ACTIVE"/>
          <bitfield caption="HwEvent" mask="0x00020000" name="HWEVENT"/>
        </register>
        <register caption="SpW Link 1 Escape Character Status" name="SPW_LINK1_ESCCHARSTS" offset="0x438" rw="R" size="4">
          <bitfield caption="Esc Char 1" mask="0x000000FF" name="CHAR1"/>
          <bitfield caption="Esc Char 2" mask="0x0000FF00" name="CHAR2"/>
        </register>
        <register caption="SpW Link 1 Transmit Escape Character" name="SPW_LINK1_TRANSESC" offset="0x43C" rw="RW" size="4">
          <bitfield caption="Character" mask="0x000000FF" name="CHAR"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Pending Read Masked Interrupt" name="SPW_LINK1_DISTINTPI_RM" offset="0x440" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Pending Read and Clear Masked Interrupt" name="SPW_LINK1_DISTINTPI_RCM" offset="0x444" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Pending Read Interrupt" name="SPW_LINK1_DISTINTPI_R" offset="0x448" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Pending Read and Clear Interrupt" name="SPW_LINK1_DISTINTPI_RCS" offset="0x44C" rw="RW" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Mask" name="SPW_LINK1_DISTINTIM" offset="0x450" rw="RW" size="4">
          <bitfield caption="Distributed Interrupt mask" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt mask" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 1 Distributed Interrupt Clear Pending Interrupt" name="SPW_LINK1_DISTINTPI_C" offset="0x454" rw="W" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
