Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SpW Link 2 Pending Read Masked Interrupt" name="SPW_LINK2_PI_RM" offset="0x480" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Pending Read Interrupt" name="SPW_LINK2_PI_R" offset="0x488" rw="R" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Pending Read, Clear and Enabled Interrupt" name="SPW_LINK2_PI_RCS" offset="0x48C" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Interrupt Mask" name="SPW_LINK2_IM" offset="0x490" rw="RW" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Clear Pending Interrupt" name="SPW_LINK2_PI_C" offset="0x494" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Interrupt Set Mask" name="SPW_LINK2_IM_S" offset="0x498" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Interrupt Clear Mask" name="SPW_LINK2_IM_C" offset="0x49C" rw="W" size="4">
          <bitfield caption="DisErr" mask="0x00000001" name="DISERR"/>
          <bitfield caption="ParErr" mask="0x00000002" name="PARERR"/>
          <bitfield caption="ESCErr" mask="0x00000004" name="ESCERR"/>
          <bitfield caption="CrErr" mask="0x00000008" name="CRERR"/>
          <bitfield caption="LinkAbort" mask="0x00000010" name="LINKABORT"/>
          <bitfield caption="EEP transmitted" mask="0x00000020" name="EEPTRANS"/>
          <bitfield caption="EEP received" mask="0x00000040" name="EEPREC"/>
          <bitfield caption="Discard" mask="0x00000080" name="DISCARD"/>
          <bitfield caption="Escape Event 2" mask="0x00000100" name="ESCEVENT2"/>
          <bitfield caption="Escape Event 1" mask="0x00000200" name="ESCEVENT1"/>
        </register>
        <register caption="SpW Link 2 Config" name="SPW_LINK2_CFG" offset="0x4A0" rw="RW" size="4">
          <bitfield caption="Command" mask="0x00000003" name="COMMAND" values="SPW_LINK2_CFG__COMMAND"/>
        </register>
        <register caption="SpW Link 2 Clock Division" name="SPW_LINK2_CLKDIV" offset="0x4A4" rw="RW" size="4">
          <bitfield caption="TxOperDiv" mask="0x0000001F" name="TXOPERDIV"/>
          <bitfield caption="TxInitDiv" mask="0x001F0000" name="TXINITDIV"/>
        </register>
        <register caption="SpW Link 2 Status" name="SPW_LINK2_STATUS" offset="0x4A8" rw="R" size="4">
          <bitfield caption="LinkState" mask="0x00000007" name="LINKSTATE" values="SPW_LINK2_STATUS__LINKSTATE"/>
          <bitfield caption="TxDefDiv" mask="0x000001F0" name="TXDEFDIV"/>
          <bitfield caption="TxEmpty" mask="0x00010000" name="TXEMPTY"/>
          <bitfield caption="GotNull" mask="0x00020000" name="GOTNULL"/>
          <bitfield caption="GotFCT" mask="0x00040000" name="GOTFCT"/>
          <bitfield caption="GotNChar" mask="0x00080000" name="GOTNCHAR"/>
          <bitfield caption="SEEN0" mask="0x00100000" name="SEEN0"/>
          <bitfield caption="SEEN1" mask="0x00200000" name="SEEN1"/>
          <bitfield caption="SEEN2" mask="0x00400000" name="SEEN2"/>
          <bitfield caption="SEEN3" mask="0x00800000" name="SEEN3"/>
          <bitfield caption="SEEN4" mask="0x01000000" name="SEEN4"/>
          <bitfield caption="SEEN5" mask="0x02000000" name="SEEN5"/>
        </register>
        <register caption="SpW Link 2 Software Reset" name="SPW_LINK2_SWRESET" offset="0x4AC" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="SpW Link 2 Escape Character Event" name="SPW_LINK2_ESCCHAREVENT" offset="0x4B0" rw="RW" size="4" count="2">
          <bitfield caption="Value" mask="0x000000FF" name="VALUE"/>
          <bitfield caption="Mask" mask="0x0000FF00" name="MASK"/>
          <bitfield caption="Active" mask="0x00010000" name="ACTIVE"/>
          <bitfield caption="HwEvent" mask="0x00020000" name="HWEVENT"/>
        </register>
        <register caption="SpW Link 2 Escape Character Status" name="SPW_LINK2_ESCCHARSTS" offset="0x4B8" rw="R" size="4">
          <bitfield caption="Esc Char 1" mask="0x000000FF" name="CHAR1"/>
          <bitfield caption="Esc Char 2" mask="0x0000FF00" name="CHAR2"/>
        </register>
