Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SpW Link 2 Transmit Escape Character" name="SPW_LINK2_TRANSESC" offset="0x4BC" rw="RW" size="4">
          <bitfield caption="Character" mask="0x000000FF" name="CHAR"/>
        </register>
        <register caption="SpW Link 2 Distributed Interrupt Pending Read Masked Interrupt" name="SPW_LINK2_DISTINTPI_RM" offset="0x4C0" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 2 Distributed Interrupt Pending Read and Clear Masked Interrupt" name="SPW_LINK2_DISTINTPI_RCM" offset="0x4C4" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 2 Distributed Interrupt Pending Read Interrupt" name="SPW_LINK2_DISTINTPI_R" offset="0x4C8" rw="R" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
        <register caption="SpW Link 2 Distributed Interrupt Pending Read and Clear Interrupt" name="SPW_LINK2_DISTINTPI_RCS" offset="0x4CC" rw="RW" size="4">
          <bitfield caption="Distributed Interrupt" mask="0x00000001" name="DI0"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000002" name="DI1"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000004" name="DI2"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000008" name="DI3"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000010" name="DI4"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000020" name="DI5"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000040" name="DI6"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000080" name="DI7"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000100" name="DI8"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000200" name="DI9"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000400" name="DI10"/>
          <bitfield caption="Distributed Interrupt" mask="0x00000800" name="DI11"/>
          <bitfield caption="Distributed Interrupt" mask="0x00001000" name="DI12"/>
          <bitfield caption="Distributed Interrupt" mask="0x00002000" name="DI13"/>
          <bitfield caption="Distributed Interrupt" mask="0x00004000" name="DI14"/>
          <bitfield caption="Distributed Interrupt" mask="0x00008000" name="DI15"/>
          <bitfield caption="Distributed Interrupt" mask="0x00010000" name="DI16"/>
          <bitfield caption="Distributed Interrupt" mask="0x00020000" name="DI17"/>
          <bitfield caption="Distributed Interrupt" mask="0x00040000" name="DI18"/>
          <bitfield caption="Distributed Interrupt" mask="0x00080000" name="DI19"/>
          <bitfield caption="Distributed Interrupt" mask="0x00100000" name="DI20"/>
          <bitfield caption="Distributed Interrupt" mask="0x00200000" name="DI21"/>
          <bitfield caption="Distributed Interrupt" mask="0x00400000" name="DI22"/>
          <bitfield caption="Distributed Interrupt" mask="0x00800000" name="DI23"/>
          <bitfield caption="Distributed Interrupt" mask="0x01000000" name="DI24"/>
          <bitfield caption="Distributed Interrupt" mask="0x02000000" name="DI25"/>
          <bitfield caption="Distributed Interrupt" mask="0x04000000" name="DI26"/>
          <bitfield caption="Distributed Interrupt" mask="0x08000000" name="DI27"/>
          <bitfield caption="Distributed Interrupt" mask="0x10000000" name="DI28"/>
          <bitfield caption="Distributed Interrupt" mask="0x20000000" name="DI29"/>
          <bitfield caption="Distributed Interrupt" mask="0x40000000" name="DI30"/>
          <bitfield caption="Distributed Interrupt" mask="0x80000000" name="DI31"/>
        </register>
