Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="PktTx Software Reset" name="SPW_PKTTX1_SWRESET" offset="0xC3C" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="SpW RMAP 1 Config" name="SPW_RMAP1_CFG" offset="0x00000E00" rw="RW" size="4">
          <bitfield caption="DestKey" mask="0x000000FF" name="DESTKEY"/>
          <bitfield caption="Address" mask="0x0000FF00" name="TLA"/>
          <bitfield caption="RMAP Enable" mask="0x00010000" name="RMAPENA"/>
        </register>
        <register caption="SpW RMAP 1 Read and Clear Status" name="SPW_RMAP1_STS_RC" offset="0x00000E04" rw="R" size="4">
          <bitfield caption="Error Code" mask="0x000000FF" name="ERRCODE" values="SPW_RMAP1_STS_RC__ERRCODE"/>
          <bitfield caption="Valid" mask="0x00000100" name="VALID"/>
        </register>
        <register caption="SpW RMAP 1 Read Status" name="SPW_RMAP1_STS" offset="0x00000E08" rw="R" size="4">
          <bitfield caption="Error Code" mask="0x000000FF" name="ERRCODE" values="SPW_RMAP1_STS__ERRCODE"/>
          <bitfield caption="Valid" mask="0x00000100" name="VALID"/>
        </register>
        <register caption="SpW Tch Pending Read Masked Interrupt" name="SPW_TCH_PI_RM" offset="0x00000E80" rw="R" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Pending Read Interrupt" name="SPW_TCH_PI_R" offset="0x00000E88" rw="R" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Pending Read, Clear and Enabled Interrupt" name="SPW_TCH_PI_RCS" offset="0x00000E8C" rw="RW" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Mask" name="SPW_TCH_IM" offset="0x00000E90" rw="RW" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Clear Pending Interrupt" name="SPW_TCH_PI_C" offset="0x00000E94" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Set Mask" name="SPW_TCH_IM_S" offset="0x00000E98" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Interrupt Clear Mask" name="SPW_TCH_IM_C" offset="0x00000E9C" rw="W" size="4">
          <bitfield caption="TcEvent" mask="0x00000001" name="TCEVENT"/>
          <bitfield caption="Time Code" mask="0x00000002" name="TIMECODE"/>
          <bitfield caption="Any Time Code" mask="0x00000004" name="ANYTIMECODE"/>
          <bitfield caption="Late Watchdog" mask="0x00000008" name="LATEWD"/>
          <bitfield caption="Early Watchdog" mask="0x00000010" name="EARLYWD"/>
        </register>
        <register caption="SpW Tch Config Listener" name="SPW_TCH_CFGLISTEN" offset="0x00000EA0" rw="RW" size="4">
          <bitfield caption="Listen link 1" mask="0x00000001" name="L1"/>
          <bitfield caption="Listen link 2" mask="0x00000002" name="L2"/>
        </register>
        <register caption="SpW Tch Config Sender" name="SPW_TCH_CFGSEND" offset="0x00000EA4" rw="RW" size="4">
          <bitfield caption="Send link 1" mask="0x00000001" name="S1"/>
          <bitfield caption="Send link 2" mask="0x00000002" name="S2"/>
        </register>
        <register caption="SpW Tch Config" name="SPW_TCH_CFG" offset="0x00000EA8" rw="RW" size="4">
          <bitfield caption="Event" mask="0x0000003F" name="EVENT"/>
        </register>
        <register caption="SpW Tch Config Restart" name="SPW_TCH_CFGRESTART" offset="0x00000EAC" rw="RW" size="4">
          <bitfield caption="Value" mask="0x0000003F" name="VALUE"/>
          <bitfield caption="Event" mask="0x00003F00" name="EVENT"/>
          <bitfield caption="Pps" mask="0x00004000" name="PPS"/>
          <bitfield caption="One Shot" mask="0x00008000" name="ONESHOT"/>
        </register>
        <register caption="SpW Tch Config Tc Event" name="SPW_TCH_CFGTCEVENT" offset="0x00000EB0" rw="RW" size="4">
          <bitfield caption="Value" mask="0x0000003F" name="VALUE"/>
          <bitfield caption="Mask" mask="0x00003F00" name="MASK"/>
        </register>
