Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="SpW Tch Config Watchdog" name="SPW_TCH_CFGWD" offset="0x00000EB4" rw="RW" size="4">
          <bitfield caption="Late" mask="0x0000FFFF" name="LATE"/>
          <bitfield caption="Early" mask="0xFFFF0000" name="EARLY"/>
        </register>
        <register caption="SpW Tch Last Time Code" name="SPW_TCH_LASTTIMECODE" offset="0x00000EB8" rw="RW" size="4">
          <bitfield caption="Value" mask="0x0000003F" name="VALUE"/>
          <bitfield caption="Send Now" mask="0x00000100" name="SEND"/>
        </register>
        <register caption="SpW Tch Software Reset" name="SPW_TCH_SWRESET" offset="0x00000EBC" rw="RW" size="4">
          <bitfield caption="Pattern" mask="0xFFFFFFFF" name="PATTERN"/>
        </register>
        <register caption="SpW Group Interrupt status 1" name="SPW_GROUP_IRQSTS1" offset="0x00000F00" rw="R" size="4">
          <bitfield caption="Tx 1" mask="0x00000080" name="TX1"/>
          <bitfield caption="Rx 1" mask="0x00008000" name="RX1"/>
          <bitfield caption="Time Code Handler" mask="0x00010000" name="TCH"/>
        </register>
        <register caption="SpW Group Interrupt status 2" name="SPW_GROUP_IRQSTS2" offset="0x00000F04" rw="R" size="4">
          <bitfield caption="Link 2" mask="0x00040000" name="Link2"/>
          <bitfield caption="Distributed Interrupt Acknowledge, Link 2" mask="0x00080000" name="Dia2"/>
          <bitfield caption="Distributed Interrupt 2" mask="0x00100000" name="Di2"/>
          <bitfield caption="Link 1" mask="0x00200000" name="Link1"/>
          <bitfield caption="Distributed Interrupt Acknowledge, Link 1" mask="0x00400000" name="Dia1"/>
          <bitfield caption="Distributed Interrupt 1" mask="0x00800000" name="Di1"/>
        </register>
        <register caption="SpW Group Interrupt status" name="SPW_GROUP_EDACSTS" offset="0x00000F0C" rw="R" size="4">
          <bitfield caption="Correction Count" mask="0x000000FF" name="CORR"/>
          <bitfield caption="Uncorrectable Error" mask="0x0000FF00" name="UNCORR"/>
        </register>
      </register-group>
      <value-group caption="Command" name="SPW_LINK1_CFG__COMMAND">
        <value caption="The link proceeds directly to the ErrorReset state when reaching the Run state." name="LINK_DISABLE" value="0x0"/>
        <value caption="State is not actively changed." name="NO_COMMAND" value="0x1"/>
        <value caption="The Codec will wait in state Ready until the first NULL character is received." name="AUTO_START" value="0x2"/>
        <value caption="SpaceWire link can proceed to Started state." name="LINK_START" value="0x3"/>
      </value-group>
      <value-group caption="LinkState" name="SPW_LINK1_STATUS__LINKSTATE">
        <value caption="CODEC link state machine in ErrorReset state" name="ERRORRESET" value="0x0"/>
        <value caption="CODEC link state machine in ErrorWait state" name="ERRORWAIT" value="0x1"/>
        <value caption="CODEC link state machine in Ready state" name="READY" value="0x2"/>
        <value caption="CODEC link state machine in Started state" name="STARTED" value="0x3"/>
        <value caption="CODEC link state machine in Connecting state" name="CONNECTING" value="0x4"/>
        <value caption="CODEC link state machine in Run state" name="RUN" value="0x5"/>
      </value-group>
      <value-group caption="Command" name="SPW_LINK2_CFG__COMMAND">
        <value caption="The link proceeds directly to the ErrorReset state when reaching the Run state." name="LINK_DISABLE" value="0x0"/>
        <value caption="State is not actively changed." name="NO_COMMAND" value="0x1"/>
        <value caption="The Codec will wait in state Ready until the first NULL character is received." name="AUTO_START" value="0x2"/>
        <value caption="SpaceWire link can proceed to Started state." name="LINK_START" value="0x3"/>
      </value-group>
      <value-group caption="LinkState" name="SPW_LINK2_STATUS__LINKSTATE">
        <value caption="CODEC link state machine in ErrorReset state" name="ERRORRESET" value="0x0"/>
        <value caption="CODEC link state machine in ErrorWait state" name="ERRORWAIT" value="0x1"/>
        <value caption="CODEC link state machine in Ready state" name="READY" value="0x2"/>
        <value caption="CODEC link state machine in Started state" name="STARTED" value="0x3"/>
        <value caption="CODEC link state machine in Connecting state" name="CONNECTING" value="0x4"/>
        <value caption="CODEC link state machine in Run state" name="RUN" value="0x5"/>
      </value-group>
      <value-group caption="Start Mode" name="SPW_PKTRX1_NXTBUFCFG__START">
        <value caption="Start if any bit in Start Value matches an incoming event" name="STARTEVENT" value="0x0"/>
        <value caption="Start immediately. Request a deactivation on next packet boundary." name="STARTNOW" value="0x1"/>
        <value caption="Start if Start Value matches an incoming Time Code from Time Code Handler 1" name="STARTTCH1" value="0x2"/>
        <value caption="Start when Current Buffer is deactivated, e.g. by becoming full" name="STARTLATER" value="0x4"/>
      </value-group>
      <value-group caption="Previous" name="SPW_PKTTX1_STATUS__PREV">
        <value caption="No information. Field not locked." name="NOINFO" value="0x0"/>
        <value caption="Last send list fully done" name="LASTSENDLISTOK" value="0x1"/>
        <value caption="Aborted due to memory access error." name="ABORTEDMEMERR" value="0x2"/>
        <value caption="Aborted by new send list." name="ABORTEDNEWSD" value="0x3"/>
        <value caption="Aborted by direct user command." name="ABORTEDUSERCMD" value="0x4"/>
        <value caption="Aborted by timeout." name="ABORTEDTIMEOUT" value="0x5"/>
      </value-group>
      <value-group caption="Start Mode" name="SPW_PKTTX1_NXTSENDCFG__START">
        <value caption="Start if any bit in Start Value matches an incoming event" name="STARTEVENT" value="0x0"/>
        <value caption="Start immediately, if possible" name="STARTNOW" value="0x1"/>
        <value caption="Start if Start Value matches an incoming Time Code from Time Code Handler 1" name="STARTTCH1" value="0x2"/>
      </value-group>
