Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Error Code" name="SPW_RMAP1_STS_RC__ERRCODE">
        <value caption="No error detected" name="NOERROR" value="0x0"/>
        <value caption="Error while DMA accessing the internal bus, e.g. illegal address." name="DMAERROR" value="0x1"/>
        <value caption="Unused RMAP command according to [RMAP]" name="RMAPERROR" value="0x2"/>
        <value caption="Destination key error" name="DESTKEYERROR" value="0x3"/>
        <value caption="Data CRC error" name="DATACRCERROR" value="0x4"/>
        <value caption="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." name="EOPERROR" value="0x5"/>
        <value caption="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." name="CARGOERROR" value="0x6"/>
        <value caption="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." name="EEPERROR" value="0x7"/>
        <value caption="Authorisation error: Invalid or unsupported command." name="CMDERROR" value="0xA"/>
        <value caption="Non-matching Target Logical Address." name="TLAERROR" value="0xC"/>
        <value caption="Incorrect header CRC." name="HEADERCRCERROR" value="0x10"/>
        <value caption="Protocol Identifier not supported." name="PROTOCOLIDERROR" value="0x11"/>
        <value caption="Unsupported reply address length" name="REPLYADDERROR" value="0x12"/>
      </value-group>
      <value-group caption="Error Code" name="SPW_RMAP1_STS__ERRCODE">
        <value caption="No error detected" name="NOERROR" value="0x0"/>
        <value caption="Error while DMA accessing the internal bus, e.g. illegal address." name="DMAERROR" value="0x1"/>
        <value caption="Unused RMAP command according to [RMAP]" name="RMAPERROR" value="0x2"/>
        <value caption="Destination key error" name="DESTKEYERROR" value="0x3"/>
        <value caption="Data CRC error" name="DATACRCERROR" value="0x4"/>
        <value caption="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." name="EOPERROR" value="0x5"/>
        <value caption="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." name="CARGOERROR" value="0x6"/>
        <value caption="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." name="EEPERROR" value="0x7"/>
        <value caption="Authorisation error: Invalid or unsupported command." name="CMDERROR" value="0xA"/>
        <value caption="Non-matching Target Logical Address." name="TLAERROR" value="0xC"/>
        <value caption="Incorrect header CRC." name="HEADERCRCERROR" value="0x10"/>
        <value caption="Protocol Identifier not supported." name="PROTOCOLIDERROR" value="0x11"/>
        <value caption="Unsupported reply address length" name="REPLYADDERROR" value="0x12"/>
      </value-group>
    </module>
    <module caption="Supply Controller" name="SUPC" id="44082" version="C">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Shall be always write at '0'" mask="0x00000004" name="ZERO"/>
          <bitfield caption="Timing Domain Crystal Oscillator Select" mask="0x00000008" name="TDXTALSEL" values="SUPC_CR__TDXTALSEL"/>
          <bitfield caption="Monitoring Domain RC Oscillator Select" mask="0x00000020" name="MDRCSEL" values="SUPC_CR__MDRCSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Core Supply Monitor User Selection" mask="0x00800000" name="CORESMUSEL"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="VDDCORE Supply Monitor Reset Enable" mask="0x00001000" name="CORSMRSTEN" values="SUPC_MR__CORSMRSTEN"/>
          <bitfield caption="VDDCORE Supply Monitor Disable" mask="0x00002000" name="CORSMDIS" values="SUPC_MR__CORSMDIS"/>
          <bitfield caption="Shall be always write at '0'" mask="0x00100000" name="ZERO"/>
          <bitfield caption="Fast Startup 32.768 kHz Crystal Oscillator" mask="0x00400000" name="FXTALSTUP"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="VDDCORE Supply Monitor Reset Status (cleared on read)" mask="0x00000008" name="CORSMRSTS" values="SUPC_SR__CORSMRSTS"/>
          <bitfield caption="32 kHz Oscillator Selection Status" mask="0x00000080" name="TDOSCSEL" values="SUPC_SR__TDOSCSEL"/>
        </register>
        <register caption="Supply Controller Power Register" name="SUPC_PWR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="MD_SLCK always generated by the slow RC oscillator" mask="0x00040000" name="ZERO"/>
        </register>
        <register caption="Write Protection Mode Register" name="SYSC_WPMR" offset="0xD4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key." mask="0xFFFFFF00" name="WPKEY" values="SYSC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Timing Domain Crystal Oscillator Select" name="SUPC_CR__TDXTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock of the timing domain (TD_SLCK) on the 32.768 kHz crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
