Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Monitoring Domain RC Oscillator Select" name="SUPC_CR__MDRCSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock of the monitoring domain (MD_SLCK) on the slow RC oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="Password" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="VDDCORE Supply Monitor Reset Enable" name="SUPC_MR__CORSMRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a VDDCORE supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal, vddcore_nreset is asserted when a VDDCORE supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="VDDCORE Supply Monitor Disable" name="SUPC_MR__CORSMDIS">
        <value caption="The VDDCORE supply monitor is enabled." name="ENABLE" value="0"/>
        <value caption="The VDDCORE supply monitor is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="Password Key" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="VDDCORE Supply Monitor Reset Status (cleared on read)" name="SUPC_SR__CORSMRSTS">
        <value caption="No VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="32 kHz Oscillator Selection Status" name="SUPC_SR__TDOSCSEL">
        <value caption="The timing domain slow clock, TD_SLCK, is generated by the slow RC oscillator." name="RC" value="0"/>
        <value caption="The timing domain slow clock, TD_SLCK, is generated by the 32.768 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key." name="SYSC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x525443"/>
      </value-group>
    </module>
    <module caption="Timer Counter" name="TC" id="6082" version="ZO">
      <register-group name="TC_CHANNEL" size="64">
        <register caption="Channel Control Register" name="TC_CCR" offset="0x0" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register" name="TC_CMR" offset="0x4" rw="RW" size="4">
          <mode name="CAPTURE" qualifier="TC_CMR.WAVE" value="0x0" caption="Capture"/>
          <mode name="WAVEFORM" qualifier="TC_CMR.WAVE" value="0x1" caption="Waveform"/>
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR0__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR0__BURST"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Stopped with RC Compare" mask="0x00000040" name="CPCSTOP"/>
          <bitfield modes="CAPTURE" caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield modes="WAVEFORM" caption="Counter Clock Disable with RC Loading" mask="0x00000080" name="CPCDIS"/>
          <bitfield modes="CAPTURE" caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR0__ETRGEDG"/>
          <bitfield modes="WAVEFORM" caption="External Event Edge Selection" mask="0x00000300" name="EEVTEDG" values="TC_CMR0__EEVTEDG"/>
          <bitfield modes="CAPTURE" caption="TIOAx or TIOBx External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield modes="WAVEFORM" caption="External Event Selection" mask="0x00000C00" name="EEVT" values="TC_CMR0__EEVT"/>
          <bitfield modes="WAVEFORM" caption="External Event Trigger Enable" mask="0x00001000" name="ENETRG"/>
          <bitfield modes="WAVEFORM" caption="Waveform Selection" mask="0x00006000" name="WAVSEL" values="TC_CMR0__WAVSEL"/>
          <bitfield modes="CAPTURE" caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield modes="CAPTURE" caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR0__LDRA"/>
          <bitfield modes="WAVEFORM" caption="RA Compare Effect on TIOAx" mask="0x00030000" name="ACPA" values="TC_CMR0__ACPA"/>
          <bitfield modes="CAPTURE" caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR0__LDRB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOAx" mask="0x000C0000" name="ACPC" values="TC_CMR0__ACPC"/>
          <bitfield modes="CAPTURE" caption="Loading Edge Subsampling Ratio" mask="0x00700000" name="SBSMPLR" values="TC_CMR0__SBSMPLR"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOAx" mask="0x00300000" name="AEEVT" values="TC_CMR0__AEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOAx" mask="0x00C00000" name="ASWTRG" values="TC_CMR0__ASWTRG"/>
          <bitfield modes="WAVEFORM" caption="RB Compare Effect on TIOBx" mask="0x03000000" name="BCPB" values="TC_CMR0__BCPB"/>
          <bitfield modes="WAVEFORM" caption="RC Compare Effect on TIOBx" mask="0x0C000000" name="BCPC" values="TC_CMR0__BCPC"/>
          <bitfield modes="WAVEFORM" caption="External Event Effect on TIOBx" mask="0x30000000" name="BEEVT" values="TC_CMR0__BEEVT"/>
          <bitfield modes="WAVEFORM" caption="Software Trigger Effect on TIOBx" mask="0xC0000000" name="BSWTRG" values="TC_CMR0__BSWTRG"/>
        </register>
