Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register caption="Global Channel Software Request Status Register" name="XDMAC_GSWS" offset="0x3C" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Software Request Status Bit" mask="0x00000001" name="SWRS0"/>
          <bitfield caption="XDMAC Channel 1 Software Request Status Bit" mask="0x00000002" name="SWRS1"/>
          <bitfield caption="XDMAC Channel 2 Software Request Status Bit" mask="0x00000004" name="SWRS2"/>
          <bitfield caption="XDMAC Channel 3 Software Request Status Bit" mask="0x00000008" name="SWRS3"/>
          <bitfield caption="XDMAC Channel 4 Software Request Status Bit" mask="0x00000010" name="SWRS4"/>
          <bitfield caption="XDMAC Channel 5 Software Request Status Bit" mask="0x00000020" name="SWRS5"/>
          <bitfield caption="XDMAC Channel 6 Software Request Status Bit" mask="0x00000040" name="SWRS6"/>
          <bitfield caption="XDMAC Channel 7 Software Request Status Bit" mask="0x00000080" name="SWRS7"/>
          <bitfield caption="XDMAC Channel 8 Software Request Status Bit" mask="0x00000100" name="SWRS8"/>
          <bitfield caption="XDMAC Channel 9 Software Request Status Bit" mask="0x00000200" name="SWRS9"/>
          <bitfield caption="XDMAC Channel 10 Software Request Status Bit" mask="0x00000400" name="SWRS10"/>
          <bitfield caption="XDMAC Channel 11 Software Request Status Bit" mask="0x00000800" name="SWRS11"/>
          <bitfield caption="XDMAC Channel 12 Software Request Status Bit" mask="0x00001000" name="SWRS12"/>
          <bitfield caption="XDMAC Channel 13 Software Request Status Bit" mask="0x00002000" name="SWRS13"/>
          <bitfield caption="XDMAC Channel 14 Software Request Status Bit" mask="0x00004000" name="SWRS14"/>
          <bitfield caption="XDMAC Channel 15 Software Request Status Bit" mask="0x00008000" name="SWRS15"/>
          <bitfield caption="XDMAC Channel 16 Software Request Status Bit" mask="0x00010000" name="SWRS16"/>
          <bitfield caption="XDMAC Channel 17 Software Request Status Bit" mask="0x00020000" name="SWRS17"/>
          <bitfield caption="XDMAC Channel 18 Software Request Status Bit" mask="0x00040000" name="SWRS18"/>
          <bitfield caption="XDMAC Channel 19 Software Request Status Bit" mask="0x00080000" name="SWRS19"/>
          <bitfield caption="XDMAC Channel 20 Software Request Status Bit" mask="0x00100000" name="SWRS20"/>
          <bitfield caption="XDMAC Channel 21 Software Request Status Bit" mask="0x00200000" name="SWRS21"/>
          <bitfield caption="XDMAC Channel 22 Software Request Status Bit" mask="0x00400000" name="SWRS22"/>
          <bitfield caption="XDMAC Channel 23 Software Request Status Bit" mask="0x00800000" name="SWRS23"/>
          <bitfield caption="XDMAC Channel 24 Software Request Status Bit" mask="0x01000000" name="SWRS24"/>
          <bitfield caption="XDMAC Channel 25 Software Request Status Bit" mask="0x02000000" name="SWRS25"/>
          <bitfield caption="XDMAC Channel 26 Software Request Status Bit" mask="0x04000000" name="SWRS26"/>
          <bitfield caption="XDMAC Channel 27 Software Request Status Bit" mask="0x08000000" name="SWRS27"/>
          <bitfield caption="XDMAC Channel 28 Software Request Status Bit" mask="0x10000000" name="SWRS28"/>
          <bitfield caption="XDMAC Channel 29 Software Request Status Bit" mask="0x20000000" name="SWRS29"/>
          <bitfield caption="XDMAC Channel 30 Software Request Status Bit" mask="0x40000000" name="SWRS30"/>
          <bitfield caption="XDMAC Channel 31 Software Request Status Bit" mask="0x80000000" name="SWRS31"/>
        </register>
        <register caption="Global Channel Software Flush Request Register" name="XDMAC_GSWF" offset="0x40" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Flush Request Bit" mask="0x00000001" name="SWF0"/>
          <bitfield caption="XDMAC Channel 1 Software Flush Request Bit" mask="0x00000002" name="SWF1"/>
          <bitfield caption="XDMAC Channel 2 Software Flush Request Bit" mask="0x00000004" name="SWF2"/>
          <bitfield caption="XDMAC Channel 3 Software Flush Request Bit" mask="0x00000008" name="SWF3"/>
          <bitfield caption="XDMAC Channel 4 Software Flush Request Bit" mask="0x00000010" name="SWF4"/>
          <bitfield caption="XDMAC Channel 5 Software Flush Request Bit" mask="0x00000020" name="SWF5"/>
          <bitfield caption="XDMAC Channel 6 Software Flush Request Bit" mask="0x00000040" name="SWF6"/>
          <bitfield caption="XDMAC Channel 7 Software Flush Request Bit" mask="0x00000080" name="SWF7"/>
          <bitfield caption="XDMAC Channel 8 Software Flush Request Bit" mask="0x00000100" name="SWF8"/>
          <bitfield caption="XDMAC Channel 9 Software Flush Request Bit" mask="0x00000200" name="SWF9"/>
          <bitfield caption="XDMAC Channel 10 Software Flush Request Bit" mask="0x00000400" name="SWF10"/>
          <bitfield caption="XDMAC Channel 11 Software Flush Request Bit" mask="0x00000800" name="SWF11"/>
          <bitfield caption="XDMAC Channel 12 Software Flush Request Bit" mask="0x00001000" name="SWF12"/>
          <bitfield caption="XDMAC Channel 13 Software Flush Request Bit" mask="0x00002000" name="SWF13"/>
          <bitfield caption="XDMAC Channel 14 Software Flush Request Bit" mask="0x00004000" name="SWF14"/>
          <bitfield caption="XDMAC Channel 15 Software Flush Request Bit" mask="0x00008000" name="SWF15"/>
          <bitfield caption="XDMAC Channel 16 Software Flush Request Bit" mask="0x00010000" name="SWF16"/>
          <bitfield caption="XDMAC Channel 17 Software Flush Request Bit" mask="0x00020000" name="SWF17"/>
          <bitfield caption="XDMAC Channel 18 Software Flush Request Bit" mask="0x00040000" name="SWF18"/>
          <bitfield caption="XDMAC Channel 19 Software Flush Request Bit" mask="0x00080000" name="SWF19"/>
          <bitfield caption="XDMAC Channel 20 Software Flush Request Bit" mask="0x00100000" name="SWF20"/>
          <bitfield caption="XDMAC Channel 21 Software Flush Request Bit" mask="0x00200000" name="SWF21"/>
          <bitfield caption="XDMAC Channel 22 Software Flush Request Bit" mask="0x00400000" name="SWF22"/>
          <bitfield caption="XDMAC Channel 23 Software Flush Request Bit" mask="0x00800000" name="SWF23"/>
          <bitfield caption="XDMAC Channel 24 Software Flush Request Bit" mask="0x01000000" name="SWF24"/>
          <bitfield caption="XDMAC Channel 25 Software Flush Request Bit" mask="0x02000000" name="SWF25"/>
          <bitfield caption="XDMAC Channel 26 Software Flush Request Bit" mask="0x04000000" name="SWF26"/>
          <bitfield caption="XDMAC Channel 27 Software Flush Request Bit" mask="0x08000000" name="SWF27"/>
          <bitfield caption="XDMAC Channel 28 Software Flush Request Bit" mask="0x10000000" name="SWF28"/>
          <bitfield caption="XDMAC Channel 29 Software Flush Request Bit" mask="0x20000000" name="SWF29"/>
          <bitfield caption="XDMAC Channel 30 Software Flush Request Bit" mask="0x40000000" name="SWF30"/>
          <bitfield caption="XDMAC Channel 31 Software Flush Request Bit" mask="0x80000000" name="SWF31"/>
        </register>
        <register-group name="XDMAC_CHID" size="64" name-in-module="XDMAC_CHID" offset="0x50" count="32"/>
      </register-group>
      <value-group caption="Channel x Next Descriptor Enable" name="XDMAC_CNDC__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
