Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
      <value-group caption="Channel x Next Descriptor Source Update" name="XDMAC_CNDC__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor Destination Update" name="XDMAC_CNDC__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor View" name="XDMAC_CNDC__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Transfer Type" name="XDMAC_CC__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="Channel x Memory Burst Size" name="XDMAC_CC__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Synchronization" name="XDMAC_CC__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="Channel x Protection" name="XDMAC_CC__PROT">
        <value caption="Channel uses Privileged mode." name="PRIVILEGED" value="0"/>
        <value caption="Channel uses User mode." name="USER" value="1"/>
      </value-group>
      <value-group caption="Channel x Software Request Trigger" name="XDMAC_CC__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="Channel x Fill Block of Memory" name="XDMAC_CC__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="Channel x Chunk Size" name="XDMAC_CC__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="Channel x Data Width" name="XDMAC_CC__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="Channel x Source Interface Identifier" name="XDMAC_CC__SIF">
        <value caption="The data is read through system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Destination Interface Identifier" name="XDMAC_CC__DIF">
        <value caption="The data is written through system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Source Addressing Mode" name="XDMAC_CC__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Destination Addressing Mode" name="XDMAC_CC__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel Initialization Done (this bit is read-only)" name="XDMAC_CC__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="Read in Progress (this bit is read-only)" name="XDMAC_CC__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="Write in Progress (this bit is read-only)" name="XDMAC_CC__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="Peripheral Hardware Request Line Identifier" name="XDMAC_CC__PERID">
        <value caption="FLEXCOM0_TX" name="FLEXCOM0_TX" value="0"/>
        <value caption="FLEXCOM0_RX" name="FLEXCOM0_RX" value="1"/>
        <value caption="FLEXCOM1_TX" name="FLEXCOM1_TX" value="2"/>
        <value caption="FLEXCOM1_RX" name="FLEXCOM1_RX" value="3"/>
        <value caption="FLEXCOM2_TX" name="FLEXCOM2_TX" value="4"/>
        <value caption="FLEXCOM2_RX" name="FLEXCOM2_RX" value="5"/>
        <value caption="FLEXCOM3_TX" name="FLEXCOM3_TX" value="6"/>
        <value caption="FLEXCOM3_RX" name="FLEXCOM3_RX" value="7"/>
        <value caption="PWM0" name="PWM0" value="8"/>
        <value caption="PWM1" name="PWM1" value="9"/>
        <value caption="TC0" name="TC0" value="10"/>
        <value caption="TC1" name="TC1" value="11"/>
        <value caption="TC2" name="TC2" value="12"/>
        <value caption="SHA" name="SHA" value="13"/>
        <value caption="TC1_CPA" name="TC1_CPA" value="14"/>
        <value caption="TC4_CPA" name="TC4_CPA" value="15"/>
        <value caption="TC7_CPA" name="TC7_CPA" value="16"/>
        <value caption="TC1_CPB" name="TC1_CPB" value="17"/>
        <value caption="TC4_CPB" name="TC4_CPB" value="18"/>
        <value caption="TC7_CPB" name="TC7_CPB" value="19"/>
        <value caption="TC1_CPC" name="TC1_CPC" value="20"/>
        <value caption="TC4_CPC" name="TC4_CPC" value="21"/>
        <value caption="TC7_CPC" name="TC7_CPC" value="22"/>
        <value caption="TC1_ETRG" name="TC1_ETRG" value="23"/>
        <value caption="TC4_ETRG" name="TC4_ETRG" value="24"/>
        <value caption="TC7_ETRG" name="TC7_ETRG" value="25"/>
        <value caption="ADCC" name="ADCC" value="26"/>
        <value caption="DACC" name="DACC" value="27"/>
        <value caption="PCC" name="PCC" value="28"/>
      </value-group>
    </module>
    <module name="FUSES" id="1" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="R" caption="USER Page Word 0. Contains factory setting values, do no override.">
          <bitfield caption="RC Trim CRC" mask="0xFFFFFFFF" name="RC_TRIM_CRC"/>
        </register>
