Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.1.43/atdf/ATSAMRH707F18A.atdf
        <register offset="0x00000014" size="4" name="MVFR1" initval="0x11000011" rw="R" caption="Media and VFP Feature Register 1">
          <bitfield mask="0x0000000F" name="FtZ_mode" caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
          <bitfield mask="0x000000F0" name="D_NaN_mode" caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
          <bitfield mask="0x0F000000" name="FP_HPFP" caption="Floating Point Half-Precision and double-precision"/>
          <bitfield mask="0xF0000000" name="FP_fused_MAC" caption="Indicates whether the FP supports fused multiply accumulate operations"/>
        </register>
        <register offset="0x00000018" size="4" name="MVFR2" initval="0x00000040" rw="R" caption="Media and VFP Feature Register 2">
          <bitfield mask="0x000000F0" name="VFP_Misc" caption="Indicates the hardware support for FP miscellaneous features"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="CQFP164">
      <pin position="1" pad="GNDCORE"/>
      <pin position="2" pad="VDDCORE"/>
      <pin position="3" pad="PA20"/>
      <pin position="4" pad="PA21"/>
      <pin position="5" pad="PA22"/>
      <pin position="6" pad="PA23"/>
      <pin position="7" pad="PA24"/>
      <pin position="8" pad="PA25"/>
      <pin position="9" pad="PA26"/>
      <pin position="10" pad="PA27"/>
      <pin position="11" pad="PA28"/>
      <pin position="12" pad="PA29"/>
      <pin position="13" pad="PA30"/>
      <pin position="14" pad="PA31"/>
      <pin position="15" pad="PB0"/>
      <pin position="16" pad="PB1"/>
      <pin position="17" pad="PB2"/>
      <pin position="18" pad="VDDPLLA_PLLB"/>
      <pin position="19" pad="GND_PLLA_PLLB"/>
      <pin position="20" pad="XIN"/>
      <pin position="21" pad="PB3"/>
      <pin position="22" pad="PB4"/>
      <pin position="23" pad="PB5"/>
      <pin position="24" pad="PB6"/>
      <pin position="25" pad="VDDIO"/>
      <pin position="26" pad="GNDIO"/>
      <pin position="27" pad="PB7"/>
      <pin position="28" pad="PB8"/>
      <pin position="29" pad="PB9"/>
      <pin position="30" pad="PB10"/>
      <pin position="31" pad="PB11"/>
      <pin position="32" pad="PB12"/>
      <pin position="33" pad="PB13"/>
      <pin position="34" pad="PB14"/>
      <pin position="35" pad="PB15"/>
      <pin position="36" pad="PB16"/>
      <pin position="37" pad="PB17"/>
      <pin position="38" pad="PB18"/>
      <pin position="39" pad="PB19"/>
      <pin position="40" pad="VDDCORE"/>
      <pin position="41" pad="GNDCORE"/>
      <pin position="42" pad="GNDCORE"/>
      <pin position="43" pad="VDDCORE"/>
      <pin position="44" pad="PB20"/>
      <pin position="45" pad="PB21"/>
      <pin position="46" pad="PB22"/>
      <pin position="47" pad="PB23"/>
      <pin position="48" pad="PB24"/>
      <pin position="49" pad="PB25"/>
      <pin position="50" pad="PB26"/>
      <pin position="51" pad="PB27"/>
      <pin position="52" pad="PB28"/>
      <pin position="53" pad="PD0"/>
      <pin position="54" pad="PD1"/>
      <pin position="55" pad="PD2"/>
      <pin position="56" pad="PD3"/>
      <pin position="57" pad="TST"/>
      <pin position="58" pad="JTAGSEL"/>
      <pin position="59" pad="NMIC_NMI"/>
      <pin position="60" pad="NRST"/>
      <pin position="61" pad="VDDIO"/>
      <pin position="62" pad="GNDIO"/>
      <pin position="63" pad="PD4"/>
      <pin position="64" pad="PD5"/>
      <pin position="65" pad="PD6"/>
      <pin position="66" pad="PD7"/>
      <pin position="67" pad="PC0"/>
      <pin position="68" pad="PC1"/>
      <pin position="69" pad="PC2"/>
      <pin position="70" pad="PC3"/>
      <pin position="71" pad="PC4"/>
      <pin position="72" pad="PC5"/>
      <pin position="73" pad="PC6"/>
      <pin position="74" pad="PC7"/>
      <pin position="75" pad="PC8"/>
      <pin position="76" pad="PC9"/>
      <pin position="77" pad="PC10"/>
      <pin position="78" pad="PC11"/>
      <pin position="79" pad="PD8"/>
      <pin position="80" pad="PD9"/>
      <pin position="81" pad="VDDCORE"/>
      <pin position="82" pad="GNDCORE"/>
      <pin position="83" pad="GNDCORE"/>
      <pin position="84" pad="VDDCORE"/>
      <pin position="85" pad="PC12"/>
      <pin position="86" pad="PC13"/>
      <pin position="87" pad="PC14"/>
      <pin position="88" pad="PC15"/>
      <pin position="89" pad="PC16"/>
      <pin position="90" pad="PC17"/>
      <pin position="91" pad="PC18"/>
      <pin position="92" pad="PC19"/>
      <pin position="93" pad="PC20"/>
      <pin position="94" pad="PC21"/>
      <pin position="95" pad="PC22"/>
      <pin position="96" pad="PC23"/>
      <pin position="97" pad="PC24"/>
      <pin position="98" pad="PC25"/>
      <pin position="99" pad="PC26"/>
      <pin position="100" pad="PC27"/>
      <pin position="101" pad="PC28"/>
      <pin position="102" pad="VDDIO"/>
      <pin position="103" pad="GNDIO"/>
      <pin position="104" pad="PD10"/>
      <pin position="105" pad="PD11"/>
      <pin position="106" pad="PD12"/>
      <pin position="107" pad="PD13"/>
      <pin position="108" pad="SPWREF0"/>
      <pin position="109" pad="PD14"/>
      <pin position="110" pad="PD15"/>
      <pin position="111" pad="PD16"/>
      <pin position="112" pad="PD17"/>
      <pin position="113" pad="PD18"/>
      <pin position="114" pad="PD19"/>
      <pin position="115" pad="PD20"/>
      <pin position="116" pad="PD21"/>
      <pin position="117" pad="SPWREF1"/>
      <pin position="118" pad="PD22"/>
      <pin position="119" pad="PD23"/>
      <pin position="120" pad="PD24"/>
      <pin position="121" pad="PD25"/>
      <pin position="122" pad="VDDCORE"/>
      <pin position="123" pad="GNDCORE"/>
      <pin position="124" pad="GNDCORE"/>
      <pin position="125" pad="VDDCORE"/>
      <pin position="126" pad="PD28"/>
      <pin position="127" pad="PD29"/>
      <pin position="128" pad="PD30"/>
      <pin position="129" pad="PD31"/>
      <pin position="130" pad="VDDIO_DAC"/>
      <pin position="131" pad="GNDIO_DAC"/>
      <pin position="132" pad="AD_DAC_GNDREF"/>
      <pin position="133" pad="AD_DAC_VREFIN"/>
      <pin position="134" pad="ANA_GND"/>
      <pin position="135" pad="ANA_3V3"/>
      <pin position="136" pad="VDDIO_ADC"/>
      <pin position="137" pad="GNDIO_ADC"/>
      <pin position="138" pad="PA0"/>
      <pin position="139" pad="PA1"/>
      <pin position="140" pad="PA2"/>
      <pin position="141" pad="PA3"/>
      <pin position="142" pad="PA4"/>
      <pin position="143" pad="VDDIO"/>
      <pin position="144" pad="GNDIO"/>
      <pin position="145" pad="PA5"/>
      <pin position="146" pad="PA6"/>
      <pin position="147" pad="PA7"/>
      <pin position="148" pad="PA8"/>
      <pin position="149" pad="PA9"/>
      <pin position="150" pad="PA10"/>
      <pin position="151" pad="PA11"/>
      <pin position="152" pad="PA12"/>
      <pin position="153" pad="PA13"/>
      <pin position="154" pad="PA14"/>
      <pin position="155" pad="PA15"/>
      <pin position="156" pad="PA16"/>
      <pin position="157" pad="XIN32"/>
      <pin position="158" pad="PC29"/>
      <pin position="159" pad="PC30"/>
      <pin position="160" pad="PA17"/>
      <pin position="161" pad="PA18"/>
      <pin position="162" pad="PA19"/>
      <pin position="163" pad="VDDCORE"/>
      <pin position="164" pad="GNDCORE"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
